{"pageProps":{"postData":{"id":"these-companies-will-raise-prices-because-of-trump","contentHtml":"<p>The ripple effects of trade policy are beginning to hit closer to home for consumers as companies brace for the impact of tariffs and warn of impending price increases.</p>\n<p>Following the Trump administration's imposition of tariffs on various imported goods, a growing number of businesses are indicating that they cannot absorb the added costs and will have to pass them on to customers in the form of higher prices.</p>\n<p>Surveys suggest that a majority of companies, particularly those operating in the U.S. and China, anticipate having to raise prices as a direct result of the tariffs. Retail giants like Walmart have already cautioned that a range of products, from everyday items like bananas to larger purchases like children's car seats, could see price hikes.</p>\n<p>However, this prospect has drawn a swift and strong reaction from President Trump himself. He has publicly warned companies considering price increases, accusing them of \"price gouging\" and urging them to \"eat the tariffs\" rather than burden consumers. Specific companies that have spoken out about potential price increases have found themselves in the president's social media crosshairs.</p>\n<p>The situation highlights the tension between the economic reality faced by businesses due to increased import costs and the administration's desire to prevent consumers from feeling the direct financial pinch of the trade measures. As companies navigate the new tariff landscape, consumers should be prepared for potential changes in the cost of goods in the coming months.</p>\n","title":"These companies will raise prices because of Trump's tariffs","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-05-24T17:10:04Z","summary":"As the Trump administration's tariffs take effect, many companies are signaling that the increased costs of imports will force them to raise prices on goods, potentially impacting consumer wallets. President Trump, however, is publicly warning companies against passing these costs onto customers.","tags":["Tariffs","Trade War","Economy","Prices","Companies","Trump Administration","Business","Consumers"]}},"__N_SSG":true}