{"pageProps":{"postData":{"id":"microsoft-notepad-can-now-write-for-you-using-gene","contentHtml":"<p>Notepad, the humble text editor that has been a staple of Windows for decades, is undergoing a surprising transformation. Microsoft is embedding generative AI capabilities directly into the application, turning the once 'barely maintained' tool into an AI-powered writing assistant.</p>\n<p>The core of this update is a new \"Write\" feature. Users can now leverage AI to quickly draft text based on a simple prompt or select existing content to have the AI build upon it. This expands upon earlier AI additions to Notepad, such as the ability to Rewrite or Summarize text.</p>\n<p>This move signifies a broader push by Microsoft to infuse its core Windows applications with artificial intelligence. Other classic tools like Paint and Snipping Tool are also receiving AI-driven updates, bringing features like AI-powered sticker generators and enhanced selection tools.</p>\n<p>However, accessing these new AI features in Notepad isn't entirely without requirements. Users will need to be signed in with a Microsoft Account. The AI processing consumes monthly AI credits, with free accounts receiving 15 credits per month and Microsoft 365 subscribers getting 60. For users who prefer the traditional, no-frills Notepad experience, there is an option to disable these AI features in the app's settings.</p>\n<p>The integration marks a significant evolution for Notepad, moving it far beyond its original purpose as a simple text editor. While social sentiment appears mostly positive, the debate continues around the integration of AI into everyday tools and the associated requirements.</p>\n<p>This update is currently rolling out to Windows Insiders and is expected to become more widely available in the coming weeks or months, bringing the power of generative AI to one of the most fundamental Windows applications.</p>\n","title":"Microsoft Notepad can now write for you using generative AI","authors":[{"username":"@alanaturner","name":"Alana Turner"}],"date":"2025-05-23T01:27:30Z","summary":"Microsoft's classic Notepad text editor is getting a modern upgrade, integrating generative AI features that allow users to draft text, expand content, and more directly within the app.","tags":["Microsoft","Notepad","Generative AI","AI","Windows","Technology","Software Updates"]}},"__N_SSG":true}