{"pageProps":{"postData":{"id":"new-video-appears-to-show-mahmoud-khalil-cooperati","contentHtml":"<p>The legal battle surrounding the detention of Mahmoud Khalil, a Columbia student and Palestinian activist, has taken a new turn with the release of video footage by his legal team.</p>\n<p>The video reportedly depicts Khalil's interaction with ICE (Immigration and Customs Enforcement) agents in the moments leading up to his detention. According to his lawyers, the footage shows Khalil cooperating with the agents, a detail they argue directly challenges the government's assertion that he posed a flight risk.</p>\n<p>Government lawyers have acknowledged in court filings that agents did not possess a warrant for Khalil's arrest at the time of his detention. Despite this, they have continued to maintain that he was a flight risk, a key justification for his apprehension.</p>\n<p>Khalil's case has drawn significant attention, not only due to the circumstances of his detention but also his identity as a student and activist. Some observers believe the outcome of his legal challenge could set a precedent for future immigration enforcement actions.</p>\n<p>Mahmoud Khalil remains in ICE detention in Louisiana as his legal team continues to fight for his release. The newly released video serves as a central piece of evidence in their argument against the government's narrative regarding the necessity and legality of his detention.</p>\n<p>Social sentiment surrounding the case appears to be largely supportive of Khalil, although there is also ongoing debate regarding the specifics of the incident and immigration policies more broadly.</p>\n","title":"New Video Appears to Show Mahmoud Khalil Cooperating With ICE Agents Before Detention","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-05-20T06:17:56Z","summary":"Legal team for Columbia student and activist Mahmoud Khalil releases footage they say contradicts the government's claim that he was a flight risk prior to his detention by ICE agents.","tags":["Mahmoud Khalil","ICE","Immigration","Detention","Civil Rights","Legal News","US News","Activism"]}},"__N_SSG":true}