{"pageProps":{"postData":{"id":"supreme-court-allows-trump-to-lay-off-nearly-1400-","contentHtml":"<p>The Supreme Court has delivered a major decision, permitting the Trump administration to proceed with the layoff of nearly 1,400 employees within the Department of Education. This action signals a key step forward for the administration's stated goal of potentially dismantling the department.</p>\n<p>The ruling pauses a lower court order that had temporarily blocked the layoffs and raised questions about the broader plan to significantly reduce the department's workforce and potentially outsource its functions to other agencies.</p>\n<p>The decision allows the administration to resume work on a process that has been a prominent promise of President Trump's campaign. While the court did not provide an immediate explanation for its order, the three liberal justices dissented, with Justice Sonia Sotomayor writing that the judiciary should check executive actions that appear to break the law.</p>\n<p>Education Department employees affected by the planned layoffs have been on paid leave for months. The lower court's injunction had prevented their full termination, though they had not been allowed to return to work. With the Supreme Court's decision, these employees face imminent termination.</p>\n<p>Lawsuits challenging the layoffs argued that they would cripple the department's ability to carry out essential functions mandated by Congress, such as supporting special education, distributing financial aid, and enforcing civil rights laws. The administration's plan involves potentially outsourcing these responsibilities.</p>\n<p>Social media reactions to the Supreme Court's decision have been varied, appearing mostly positive among supporters of the administration's agenda, but also sparking debate among those concerned about the impact on education services and the future of the department.</p>\n","title":"Supreme Court allows Trump to lay off nearly 1,400 Education Department employees","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-07-15T01:24:18Z","summary":"In a significant move, the Supreme Court has cleared the way for the Trump administration to lay off nearly 1,400 employees at the Department of Education, allowing the administration to move forward with plans to potentially wind down the agency.","tags":["Supreme Court","Donald Trump","Education Department","layoffs","politics","government","education"],"sources":[{"url":"https://www.msn.com/en-us/news/us/supreme-court-allows-trump-to-lay-off-nearly-1400-education-department-employees/ar-AA1IAVnR","title":"Supreme Court allows Trump to lay off nearly 1,400 Education Department employees"},{"url":"https://chicago.suntimes.com/education/2025/07/14/supreme-court-trump-department-of-education-employee-layoffs","title":"Supreme Court allows Trump to lay off nearly 1,400 Education Department employees"},{"url":"https://apnews.com/live/donald-trump-news-updates-7-14-2025","title":"Live updates: Supreme Court will allow mass layoffs at Education Department"},{"url":"https://www.msn.com/en-us/news/politics/supreme-court-allows-mass-firings-at-education-department-for-now/ar-AA1IAQMu","title":"Supreme Court allows Trump administration's mass firings at Education Department for now"},{"url":"https://www.msn.com/en-us/news/other/supreme-court-allows-trump-administration-to-pursue-layoffs-at-education-department/ar-AA1IAYWR","title":"Supreme Court allows Trump administration to pursue layoffs at Education Department"},{"url":"https://www.msn.com/en-us/news/us/how-trump-plans-to-dismantle-the-education-department-after-supreme-court-ruling/ar-AA1IARVz","title":"How Trump plans to dismantle the Education Department after Supreme Court ruling"}]}},"__N_SSG":true}