{"pageProps":{"postData":{"id":"verdict-reached-eight-found-guilty-in-kim-kardashi","contentHtml":"<p>After a lengthy trial in Paris, a verdict has finally been reached in the high-profile jewelry heist targeting reality star and businesswoman Kim Kardashian in October 2016.</p>\n<p>The incident, which saw Kardashian tied up and robbed at gunpoint in her luxury hotel suite during Paris Fashion Week, involved the theft of millions of dollars worth of jewelry.</p>\n<p>Ten individuals were put on trial for their alleged roles in the crime, facing charges that included armed robbery as part of an organized gang and kidnapping.</p>\n<p>On Friday, the court handed down its decision. Eight of the ten defendants were found guilty, including the alleged ringleader, Aomar Aït Khedache. Khedache, who was 69 at the time of the trial, had reportedly apologized to Kardashian during the proceedings. He was facing a potential 10-year sentence.</p>\n<p>While the identities of all those found guilty and their specific sentences are emerging, the verdict marks a significant development in a case that captured global headlines due to the celebrity victim and the brazen nature of the crime.</p>\n<p>Notably, two of the ten defendants were acquitted of the charges against them.</p>\n<p>The verdict closes a nearly decade-long chapter on one of the most talked-about celebrity robberies in recent history. Public reaction online appears to be mostly positive regarding the guilty verdicts, with some debate still surrounding the overall outcome and the details of the case.</p>\n","title":"Verdict Reached: Eight Found Guilty in Kim Kardashian Paris Jewelry Heist","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-05-23T20:14:09Z","summary":"Nearly a decade after the audacious 2016 robbery, a Paris court has delivered its verdict in the Kim Kardashian jewelry heist trial. Eight of the ten defendants have been found guilty, including the alleged ringleader, while two were acquitted.","tags":["Kim Kardashian","Paris Heist","Jewelry Robbery","Paris Crime","Court Verdict","Celebrity News"]}},"__N_SSG":true}