{"pageProps":{"postData":{"id":"federal-judge-rules-trump-administrations-nih-gran","contentHtml":"<p>In a significant legal challenge to the Trump administration's actions regarding scientific funding, a federal judge has declared that directives resulting in the cancellation of hundreds of National Institutes of Health (NIH) research grants were \"void\" and \"illegal.\"</p>\n<p>U.S. District Court Judge William Young issued the ruling, criticizing the administration's criteria for terminating the grants, which were reportedly based on associations with \"gender ideology\" and \"diversity, equity, and inclusion (DEI).\" Judge Young did not mince words, stating from the bench that he had \"never seen government racial discrimination like this\" in his 40 years on the bench, adding, \"Have we no shame?\"</p>\n<p>The ruling found the grant terminations to be \"arbitrary and capricious,\" a legal term indicating a decision made without a rational basis. The decision mandates that the government immediately make the funds available for the affected grants.</p>\n<p>The decision applies to over 800 individual grants identified in two lawsuits brought against the Trump administration and the NIH. These grants reportedly focused on critical public health issues such as racial disparities, health equity, vaccine hesitancy, and maternal health in minority communities.</p>\n<p>The Trump administration, however, defended its decisions, with a spokesman for HHS stating they stand by the decision to end funding for research that \"prioritized ideological agendas over scientific rigor and meaningful outcomes for the American people.\" A White House spokesman also criticized the judge, suggesting he used court proceedings to express political views.</p>\n<p>The Association of American Medical Colleges estimates that since February, a total of 2,282 grants, amounting to almost $3.8 billion in funding, have been revoked by the NIH.</p>\n<p>The ruling is seen as a major victory for researchers and public health advocates, who have described the cancellations as an \"ongoing ideological purge\" of scientific research.</p>\n<p>Simulated social media sentiment regarding this ruling appears mostly positive, although some debate exists.</p>\n","title":"Federal Judge Rules Trump Administration's NIH Grant Cancellations 'Void and Illegal'","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-06-17T08:23:08Z","summary":"A federal judge has forcefully ruled that directives from the Trump administration leading to the cancellation of hundreds of National Institutes of Health (NIH) research grants were unlawful and discriminatory. The decision orders many of the grants, previously cut over criteria linked to 'gender ideology' and 'DEI,' to be reinstated.","tags":["NIH","Trump administration","federal judge","research grants","discrimination","DEI","science funding","public health"],"sources":[{"url":"https://www.msn.com/en-us/news/us/federal-judge-rules-trump-directives-canceling-nih-grants-are-void-illegal/ar-AA1GR2Kz","title":"Federal judge rules Tump directives canceling NIH grants are 'void,' 'illegal'"},{"url":"https://www.msn.com/en-us/news/politics/judge-orders-many-nih-grants-restored-calling-cancellation-unlawful/ar-AA1GQ5xK","title":"Judge orders many NIH grants restored, calling cancellation unlawful"},{"url":"https://www.bostonglobe.com/2025/06/16/metro/trump-nih-cuts-lawsuit-void/","title":"Hundreds of NIH grant terminations are ‘void and illegal,’ federal judge rules"},{"url":"https://www.statnews.com/2025/06/16/nih-research-cuts-ruled-illegal-by-federal-judge-william-young/","title":"Hundreds of NIH grant terminations are ‘void and illegal,’ federal judge rules"},{"url":"https://www.msn.com/en-us/politics/government/judge-rules-some-trump-nih-grant-cuts-illegal-saying-he-s-never-seen-such-discrimination-in-40-years/ar-AA1GPVUe","title":"Judge rules some Trump NIH grant cuts illegal, saying he's never seen such discrimination in 40 years"}]}},"__N_SSG":true}