{"pageProps":{"postData":{"id":"from-a-basement-in-north-idaho-to-a-3-billion-glob","contentHtml":"<p>What if one of the biggest innovations in artificial intelligence wasn't brewing in Silicon Valley, but in a basement in downtown Coeur d’Alene, Idaho? This isn't a hypothetical scenario, but the reality for Paul Swaim and Garrett Oetken.</p>\n<p>These two North Idaho residents, with backgrounds ranging from self-taught builder to college IT manager, initially launched an AI cybersecurity startup that didn't pan out as planned. But instead of giving up, they used the experience as valuable training, learning crucial lessons on their entrepreneurial journey.</p>\n<p>Their paths reconnected through the local <code>build_ Coeur d'Alene</code> community – a space designed to foster connections and cool ideas. This collision in a basement event provided the spark they needed.</p>\n<p>Together, they became key contributors to BitTensor, a decentralized AI network that has rapidly grown to a valuation of over $3 billion. Described by investor Chamath Palihapitiya on the <em>All-In</em> podcast as the “Bitcoin of AI,” BitTensor operates on a unique model.</p>\n<p>Instead of traditional mining, participants on the BitTensor network \"mine\" by solving real-world AI tasks for companies, such as improving cancer detection models or generating 3D datasets. It's a true meritocracy where talent and results are rewarded, not just credentials or resumes. The network's validators care only about whether a problem was solved effectively.</p>\n<p>Their story highlights several powerful lessons:</p>\n<ol>\n<li><strong>Look for partners in unexpected places:</strong> World-changing collaborations can arise from unconventional connections.</li>\n<li><strong>Don't chase a job title, chase value contribution:</strong> Focus on solving problems and delivering results.</li>\n<li><strong>Do the work and fall in love with the process:</strong> The \"grind\" of late nights, testing, and building is where the real progress happens.</li>\n<li><strong>Your zip code doesn't limit your future:</strong> Innovation can thrive anywhere, supported by the right community and mindset.</li>\n<li><strong>The idea doesn't have to be perfect; just start, stay, and build:</strong> Perseverance and iteration are key.</li>\n</ol>\n<p>Swaim and Oetken's journey is more than just a tech success story; it's a human blueprint for how individuals, even from smaller towns, can leverage community and grit to contribute to global technological revolutions. It underscores that the next major innovation might be forming in a basement near you right now.</p>\n","title":"From a Basement in North Idaho to a $3 Billion Global AI Movement","authors":[{"username":"@alanaturner","name":"Alana Turner"}],"date":"2025-05-25T08:22:37Z","summary":"Discover the inspiring journey of two North Idaho locals who, after a failed startup, became pivotal figures in BitTensor, a decentralized AI network now valued at $3 billion, proving that world-changing innovation can start anywhere.","tags":["AI","BitTensor","Decentralized AI","Startup","Innovation","North Idaho","Technology","Coeur d'Alene","Meritocracy","Entrepreneurship"]}},"__N_SSG":true}