{"pageProps":{"postData":{"id":"trump-says-hes-not-looking-for-a-deal-with-eu-afte","contentHtml":"<p>President Donald Trump has signaled a significant shift in trade relations with the European Union, stating he is \"not looking for a deal\" with the bloc. The declaration follows his recent threat to impose a hefty 50% tariff on goods imported from the EU.</p>\n<p>According to reports, the President cited a lack of progress in ongoing trade negotiations as the reason for his stance. This move is seen by many as a potential revival and escalation of the global trade war initiated during his previous term.</p>\n<p>The proposed 50% tariff is substantial and could have broad implications for a wide range of goods imported from EU member states. Some reports also indicate threats of tariffs on specific items, such as smartphones not manufactured in the United States.</p>\n<p>The European Union has responded to Trump's threats, with officials reportedly calling for \"respect\" in the trade relationship and asserting that the EU is \"ready to defend\" its interests against such protectionist measures.</p>\n<p>The situation is likely to generate considerable discussion and debate, both among policymakers and the public. Simulated social media sentiment suggests a range of reactions, with a lean towards positive sentiment mixed with significant debate surrounding the potential economic impacts and strategic implications of such tariffs.</p>\n<p>This development marks a critical juncture in transatlantic trade relations and raises questions about the future of economic cooperation between the U.S. and the EU.</p>\n","title":"Trump Says He's 'Not Looking for a Deal' with EU After Threatening 50% Tariff","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-05-24T05:12:13Z","summary":"President Donald Trump has declared he is 'not looking for a deal' with the European Union, intensifying trade tensions after threatening a significant 50% tariff on EU imports, citing a lack of progress in negotiations.","tags":["Trump","EU","Tariffs","Trade Deal","Trade War","International Relations","Economics"]}},"__N_SSG":true}