{"pageProps":{"postData":{"id":"alleged-bitcoin-torture-crypto-trader-accused-of-k","contentHtml":"<p>In a disturbing incident that underscores the potential for extreme crime in the digital asset space, a crypto trader has been arrested in New York City, accused of kidnapping and torturing an Italian man in a bid to steal his Bitcoin.</p>\n<p>According to multiple news reports, the suspect, identified as John Woeltz, allegedly held a 28-year-old Italian tourist captive for several weeks inside a townhouse in Manhattan's Nolita neighborhood. During this period, authorities claim the victim was subjected to horrific acts of torture, including electric shocks, being held upside down, and receiving threats against his family.</p>\n<p>The alleged motivation behind this brutal captivity was the theft of the victim's Bitcoin. The ordeal reportedly ended when the victim managed to escape after being held for over two weeks.</p>\n<p>Woeltz was arrested following the victim's escape. This case highlights a stark and frightening reality: the immense value and decentralized nature of cryptocurrencies can sometimes attract dangerous criminal activity, moving beyond online scams into violent physical crimes.</p>\n<p>The investigation into this disturbing case is ongoing. It serves as a grim reminder that the immense value and decentralized nature of cryptocurrencies can sometimes attract dangerous criminal activity, extending beyond online scams into violent physical crimes. This incident highlights a dark chapter in the intersection of finance and crime.</p>\n","title":"Alleged Bitcoin Torture: Crypto Trader Accused of Kidnapping and Tormenting Man in NYC for Crypto","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-05-25T03:44:13Z","summary":"Authorities have arrested a crypto trader in New York City, accusing him of kidnapping and torturing an Italian tourist for weeks in a Manhattan townhouse in a brutal attempt to steal his Bitcoin holdings.","tags":["Crypto Crime","Bitcoin","Kidnapping","Torture","New York City","Crime News"]}},"__N_SSG":true}