{"pageProps":{"postData":{"id":"fred-smith-fedex-founder-and-delivery-visionary-di","contentHtml":"<p>The business world is mourning the loss of a true innovator. Fred Smith, the visionary founder of FedEx, has died at 80. A Marine Corps veteran, Smith revolutionized the logistics and transportation industry by introducing the concept of absolutely, positively overnight package delivery, a service that was initially sketched out in a college paper and widely doubted before becoming a global standard.</p>\n<p>Smith's bold idea faced skepticism, but his determination built FedEx into a multinational corporation that fundamentally changed how businesses and individuals send and receive goods. His legacy extends beyond delivery; he also had a notable impact on the sports world as a former minority owner of the NFL's Washington Commanders, with FedEx also holding the naming rights to the team's stadium for many years.</p>\n<p>His influence on American business and global commerce is undeniable. As news of his passing spreads, social media sentiment reflects widespread recognition of his achievements, acknowledging the profound impact FedEx has had on modern life, and highlighting deep respect for his entrepreneurial spirit and lasting contributions.</p>\n","title":"Fred Smith, FedEx Founder and Delivery Visionary, Dies at 80","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-06-22T12:29:18Z","summary":"Fred Smith, the pioneering founder of FedEx who transformed the global shipping industry with the concept of overnight delivery and served as a Marine Corps veteran, has passed away at the age of 80.","tags":["Fred Smith","FedEx","Business","Logistics","Obituary","Entrepreneurship","NFL"],"sources":[{"url":"https://www.msn.com/en-us/news/us/fedex-founder-fred-smith-a-marine-corps-veteran-who-revolutionized-package-delivery-dies-at-80/ar-AA1Hbv7A","title":"FedEx Founder Fred Smith, A Marine Corps Veteran Who Revolutionized Package Delivery, Dies At 80"},{"url":"https://www.msn.com/en-us/news/us/fred-smith-fedex-founder-who-revolutionized-the-package-delivery-business-dies-at-80/ar-AA1Hbu0d","title":"FedEx Founder Fred Smith, A Marine Corps Veteran Who Revolutionized Package Delivery, Dies At 80"},{"url":"https://www.msn.com/en-us/sports/nfl/father-of-steelers-offensive-coordinator-and-founder-of-fedex-fred-smith-dies-at-80/ar-AA1HbPyI","title":"Father of Steelers offensive coordinator and founder of FedEx, Fred Smith, dies at 80"},{"url":"https://www.msn.com/en-us/money/companies/fedex-founder-fred-smith-dies-at-80/ar-AA1HaQ1c","title":"FedEx founder Fred Smith dies at 80"},{"url":"https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/former-washington-minority-owner-fred-smith-dies-at-80","title":"Former Washington minority owner Fred Smith dies at 80"},{"url":"https://www.msn.com/en-us/money/companies/fred-smith-fedex-s-innovative-founder-is-dead-at-80/ar-AA1HbJL5","title":"Fred Smith, FedEx's innovative founder, is dead at 80"}]}},"__N_SSG":true}