{"pageProps":{"postData":{"id":"trump-announces-ceasefire-between-israel-and-iran","contentHtml":"<h2>Trump Announces Ceasefire Between Israel and Iran</h2>\n<p>President Donald Trump has announced that Israel and Iran have agreed to a \"complete and total ceasefire,\" aimed at bringing an end to the recent 12-day conflict between the two nations.</p>\n<p>The announcement, initially made via social media, followed a period of heightened tensions and direct exchanges of fire, including Israeli strikes targeting Iranian nuclear sites and subsequent Iranian missile attacks. While there were initial reports of violations from both sides shortly after the declaration, President Trump later confirmed the ceasefire was \"in effect\" after reportedly speaking with the Israeli leader.</p>\n<p>Sources indicate that pressure from the Trump administration played a role in de-escalating the situation, with reports suggesting Israel scaled back plans for heavier strikes on Iran. President Trump reportedly also advised Israel to withdraw its pilots.</p>\n<p>This development marks a significant moment in the volatile relationship between Israel and Iran, with the ceasefire intended to pave the way for de-escalation after nearly two weeks of hostilities. Social sentiment surrounding the announcement has been largely positive, though some debate continues regarding the future stability of the region.</p>\n<p>Further details on the implementation and monitoring of the ceasefire are anticipated as the situation develops.</p>\n","title":"Trump Announces Ceasefire Between Israel and Iran","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-06-26T08:22:21Z","summary":"President Trump announced a \"complete and total ceasefire\" between Israel and Iran, aiming to end a 12-day conflict. The ceasefire reportedly went into effect despite initial violations, with reports indicating Trump's pressure influenced Israel's decision to reduce further strikes.","tags":["Israel","Iran","Ceasefire","Donald Trump","Middle East","Conflict"],"sources":[{"url":"https://www.msn.com/en-us/news/world/trump-announces-israel-and-iran-have-agreed-to-a-ceasefire/ar-AA1Hhr0a","title":"Trump announces Israel and Iran have agreed to a ceasefire"},{"url":"https://www.msn.com/en-us/politics/government/trump-says-iran-israel-ceasefire-in-effect-after-early-violations/ar-AA1Hj5C2","title":"Trump says Iran-Israel ceasefire in effect after early violations"},{"url":"https://www.msn.com/en-us/news/world/trump-announces-historic-iran-and-israel-ceasefire-agreement-to-end-12-day-war/ar-AA1HhwQj","title":"Trump announces historic Iran and Israel ceasefire agreement to end '12 Day War'"},{"url":"https://www.msn.com/en-us/news/world/trump-announces-israel-iran-ceasefire/ar-AA1HhC8F","title":"Trump announces Israel-Iran ceasefire"},{"url":"https://www.foxnews.com/live-news/israel-iran-conflict-june-24-2025","title":"Israel backs away from heavier strikes on Iran, maintaining ceasefire after Trump pressure"},{"url":"https://www.msn.com/en-us/politics/international-relations/trump-announces-a-ceasefire-in-iran-israel-war-iran-to-halt-its-fire-if-israel-stops-its-strikes/ar-AA1HejYJ","title":"Trump announces a ceasefire in Iran-Israel war; Iran to halt its fire if Israel stops its strikes"}]}},"__N_SSG":true}