{"pageProps":{"postData":{"id":"warner-bros-discovery-announces-plan-to-split-into","contentHtml":"<p>In a significant restructuring effort, Warner Bros. Discovery has announced plans to divide its vast media empire into two independent public companies. The split, expected to be completed by next year, will see the creation of a \"Streaming &#x26; Studios\" entity and a \"Global Networks\" business.</p>\n<p>The \"Streaming &#x26; Studios\" company will house key assets such as HBO and DC Studios, focusing on the production and distribution of original content and managing the company's direct-to-consumer streaming services. Warner Bros. Discovery CEO David Zaslav is slated to lead this new venture.</p>\n<p>Meanwhile, the \"Global Networks\" company will encompass the traditional cable television portfolio, including major channels like CNN, Discovery networks, and TNT. The current CFO, Gunnar Wiedenfels, is expected to take the helm of this segment.</p>\n<p>This strategic separation reflects a broader trend in the media industry to adapt to changing consumption habits, clearly delineating between the growth-focused streaming sector and the more stable, albeit challenged, linear television business. The news has reportedly been met with a mostly positive reaction, though some debate exists regarding the potential impact and execution of the split.</p>\n","title":"Warner Bros. Discovery Announces Plan to Split into Two Companies","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-06-09T12:33:04Z","summary":"Warner Bros. Discovery is set to split into two distinct public companies by next year, separating its streaming and studio operations from its traditional cable networks. This move aims to streamline the media giant's focus in a rapidly evolving entertainment landscape.","tags":["Warner Bros. Discovery","Media","Streaming","Cable TV","Corporate Restructuring","Entertainment Industry","Business"],"sources":[{"url":"https://www.msn.com/en-us/money/companies/warner-bros-discovery-to-split-into-two-companies-dividing-cable-and-streaming-services/ar-AA1GmBac","title":"Warner Bros. Discovery to split into two companies, dividing cable and streaming services"},{"url":"https://www.msn.com/en-us/money/companies/warner-bros-discovery-to-split-into-two-companies-dividing-cable-and-streaming-services/ar-AA1GmAaP","title":"Warner Bros. Discovery to split into two companies, dividing cable and streaming services"},{"url":"https://www.msn.com/en-us/money/companies/warner-bros-discovery-unveils-plan-to-split-into-2-separate-companies/ar-AA1GmviD","title":"Warner Bros. Discovery unveils plan to split into 2 separate companies"},{"url":"https://www.msn.com/en-us/money/companies/warner-bros-discovery-splitting-into-two-media-companies/ar-AA1GmHOd","title":"Warner Bros. Discovery to split into two, separating CNN and cable networks from streaming"},{"url":"https://www.msn.com/en-us/money/companies/warner-bros-discovery-to-split-in-two-what-that-means-for-your-tv-channels/ar-AA1GmyDT","title":"Warner Bros. Discovery to split in two. What that means for your TV channels."},{"url":"https://www.msn.com/en-us/entertainment/news/warner-bros-discovery-to-split-into-two-companies-streaming-studios-will-separate-from-global-networks/ar-AA1GmoDN","title":"Warner Bros. Discovery To Split Into Two Companies; Streaming & Studios Will Separate From Global Networks"}]}},"__N_SSG":true}