{"pageProps":{"postData":{"id":"trump-administration-revokes-harvards-ability-to-e","contentHtml":"<p>In a dramatic escalation of tensions between the Trump administration and higher education institutions, the Department of Homeland Security has revoked Harvard University's ability to enroll international students.</p>\n<p>The administration's action involves rescinding Harvard's certification for the Student and Exchange Visitor Program (SEVP). This program is essential for universities to legally enroll non-citizen students who require specific visas to study in the United States.</p>\n<p>The immediate impact of this decision is far-reaching. It directly prevents Harvard from admitting new international students and could force thousands of currently enrolled international students to potentially transfer to other institutions to maintain their legal status in the country. Such a move would not only disrupt academic pursuits but also significantly affect Harvard's revenue streams, which rely in part on international student enrollment.</p>\n<p>Harvard has swiftly condemned the administration's move, characterizing it as a \"retaliatory action.\" The university argues that the decision poses a severe threat to the Harvard community and could have detrimental effects on the country as a whole, highlighting the value that international students bring to academic and cultural environments.</p>\n<p>While the immediate focus is on Harvard, the rescinding of SEVP certification raises concerns about potential similar actions or policy shifts that could affect other universities across the United States that host large international student populations.</p>\n<p>Reports on social sentiment surrounding this development indicate a mixed reaction, described as mostly positive with some ongoing debate, reflecting the broader political and social divisions regarding immigration and higher education policies.</p>\n<p>The move marks a significant development in the administration's stance on international students and institutions of higher learning, with potentially profound consequences for individual students, universities, and the academic landscape in the United States.</p>\n","title":"Trump Administration Revokes Harvard's Ability to Enroll International Students","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-05-22T21:11:30Z","summary":"In a significant move, the Trump administration has barred Harvard University from enrolling international students by rescinding its Student and Exchange Visitor Program certification, potentially impacting thousands of students and drawing sharp criticism from the university.","tags":["Trump Administration","Harvard University","International Students","SEVP","Higher Education","DHS","Immigration Policy"]}},"__N_SSG":true}