{"pageProps":{"postData":{"id":"trump-administration-releases-long-sealed-fbi-file","contentHtml":"<h3>Decades of Secrets Unsealed</h3>\n<p>The Trump administration on Monday made public a vast trove of previously classified government files related to the life and assassination of Dr. Martin Luther King Jr. The release comprises more than 230,000 pages of FBI records, including extensive surveillance files, which have been kept from public view by a court order since 1977.</p>\n<p>For decades, historians and the public have awaited access to these documents, hoping for a clearer understanding of the circumstances surrounding the civil rights icon's 1968 assassination and the government's intense monitoring of his activities.</p>\n<h3>A Move Against the Family's Wishes</h3>\n<p>The decision to release the files was made despite the vocal opposition of Dr. King's surviving children. Both Martin Luther King III and Bernice King have publicly urged caution, asking the public to be mindful of the source and the potential for misinformation within the heavily redacted documents compiled by an FBI leadership that was openly hostile to their father.</p>\n<h3>Questions of Motive and Timing</h3>\n<p>The timing of the release has not gone unnoticed. Prominent civil rights leader Reverend Al Sharpton sharply criticized the move, calling it a \"desperate attempt\" to divert media and public attention away from the ongoing firestorm surrounding the late Jeffrey Epstein and his associates.</p>\n<p>This sentiment has fueled a debate about the administration's motives. While many have lauded the release as a win for government transparency, others remain skeptical, viewing it as a calculated political maneuver.</p>\n<p>The unsealing of these historical documents ensures that the life and legacy of Martin Luther King Jr. will be re-examined and debated for years to come, offering a new, albeit complex, lens through which to view a pivotal moment in American history.</p>\n","title":"Trump Administration Releases Long-Sealed FBI Files on Martin Luther King Jr., Sparking Controversy","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-07-22T08:26:25Z","summary":"In a move generating both praise for its transparency and scrutiny over its timing, the Trump administration has released over 230,000 pages of long-sealed FBI records on Dr. Martin Luther King Jr. The release proceeds despite objections from the civil rights leader's family and has been labeled by some critics as a distraction from other political controversies.","tags":["Donald Trump","Martin Luther King Jr.","FBI","US Politics","History","Transparency"],"sources":[{"url":"https://www.msn.com/en-us/news/us/trump-administration-releases-fbi-records-on-mlk-jr-despite-his-family-s-opposition/ar-AA1J13rY","title":"Trump administration released FBI records on MLK Jr. despite his family's opposition"},{"url":"https://www.msn.com/en-us/news/us/trump-administration-releases-fbi-records-on-mlk-jr-s-assassination/ar-AA1J15Y0","title":"Trump administration releases FBI records on MLK Jr.'s assassination"},{"url":"https://www.msn.com/en-us/money/news/martin-luther-king-jr-fbi-records-released-by-trump-administration-al-sharpton-says-desperate-attempt-to-distract-people-from-epstein-firestorm/ar-AA1J1J47","title":"Martin Luther King Jr. FBI Records Released By Trump Administration: Al Sharpton Says, 'Desperate Attempt' To Distract People From Epstein Firestorm"}]}},"__N_SSG":true}