{"pageProps":{"postData":{"id":"allegations-surface-of-us-contractors-using-live-f","contentHtml":"<p>New allegations have emerged from Gaza, painting a grim picture of the challenges faced by Palestinians attempting to access humanitarian aid. According to reports and videos obtained by the Associated Press, American contractors responsible for security at aid distribution sites are allegedly using live ammunition and stun grenades as desperate and hungry civilians gather seeking food.</p>\n<p>This troubling development is corroborated by multiple news sources. Further reports highlight that charities are calling for the shutdown of a US-Israeli backed aid group in light of these events. Eyewitness accounts from Israeli soldiers stationed at these sites reportedly describe them as \"killing fields,\" where civilians are treated as a hostile force, even without posing an armed threat.</p>\n<p>The situation underscores the dire humanitarian crisis in Gaza and raises serious questions about the protocols and rules of engagement for personnel involved in aid distribution.</p>\n","title":"Allegations Surface of US Contractors Using Live Fire on Palestinians Seeking Food in Gaza","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-07-03T04:30:33Z","summary":"Disturbing reports claim American contractors guarding aid distribution sites in Gaza are employing live ammunition and stun grenades against hungry Palestinians, according to accounts and videos obtained by the Associated Press and corroborated by other news outlets.","tags":["Gaza","US contractors","Humanitarian crisis","Aid distribution","Palestine","Israel"],"sources":[{"url":"https://www.msn.com/en-us/news/world/us-contrac%20tors-say-their-colleagues-are-firing-live-ammo-as-palestinians-seek-food-in-gaza/ar-AA1HR3um","title":"US contractors say their colleagues are firing live ammo as Palestinians seek food in Gaza"},{"url":"https://www.msn.com/en-us/news/other/takeaways-from-ap-s-report-into-claims-of-excessive-force-by-american-contractors-at-gaza-aid-sites/ar-AA1HQWIU","title":"Takeaways from AP's report into claims of excessive force by American contractors at Gaza aid sites"},{"url":"https://www.bbc.com/news/articles/cn5kk1w00xyo","title":"US-Israeli backed Gaza aid group must be shut down, say 170 charities"},{"url":"https://www.latimes.com/world-nation/story/2025-06-30/22-killed-as-israeli-forces-fire-on-palestinians-in-gaza-seeking-food-aid-witnesses-say","title":"67 killed in Gaza as Israeli forces strike a cafe and fire on people seeking food"},{"url":"https://www.msn.com/en-us/news/world/it-s-a-killing-field-israeli-soldiers-describe-firing-on-civilians-at-us-backed-gaza-aid-sites/ar-AA1Hym6y","title":"\"It's a killing field\": Israeli soldiers describe firing on civilians at US-backed Gaza aid sites"}]}},"__N_SSG":true}