{"pageProps":{"postData":{"id":"legal-battle-over-national-guard-deployment-in-los","contentHtml":"<p>In a significant legal development concerning the deployment of military personnel, a U.S. judge in Los Angeles issued a temporary order barring President Trump from deploying National Guard troops in the city. The judge ruled that the mobilization of the Guard was unlawful under the circumstances.</p>\n<p>The ruling by Judge Charles Breyer mandated that control of the National Guard be returned to California Governor Gavin Newsom. This decision came amidst ongoing demonstrations and protests related to immigration enforcement operations in the Los Angeles area.</p>\n<p>The Trump administration quickly moved to appeal the judge's order. A federal appeals court panel subsequently granted a temporary stay on Judge Breyer's ruling. This action by the appeals court means that the temporary block on the National Guard deployment has been lifted, at least for now, allowing the troops to continue assisting with the operations.</p>\n<p>The legal back-and-forth highlights the tension between federal and state authority regarding the use of the National Guard and the judicial system's role in reviewing such executive actions. The situation remains fluid as the legal challenge proceeds.</p>\n","title":"Legal Battle Over National Guard Deployment in Los Angeles: Judge's Block Temporarily Lifted","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-06-13T04:25:00Z","summary":"A federal judge temporarily blocked the Trump administration's deployment of National Guard troops in Los Angeles, ruling the mobilization unlawful. However, this decision was swiftly challenged and an appeals court has temporarily lifted the block, allowing the troops to remain.","tags":["National Guard","Los Angeles","Donald Trump","Gavin Newsom","Judicial Ruling","Appeals Court","Immigration Enforcement","Politics","California"],"sources":[{"url":"https://www.msn.com/en-us/news/us/judge-temporarily-bars-trump-from-deploying-national-guard-troops-in-los-angeles/ar-AA1GCmNv","title":"Judge temporarily bars Trump from deploying National Guard troops in Los Angeles"},{"url":"https://www.msn.com/en-us/news/us/judge-blocks-trump-administration-from-deploying-national-guard-to-los-angeles/ar-AA1GBGKL","title":"Judge blocks Trump administration from deploying National Guard to Los Angeles"},{"url":"https://www.msn.com/en-us/news/politics/judge-blocks-trump-s-national-guard-deployment-in-los-angeles/ar-AA1GCprm","title":"Judge blocks Trump's National Guard deployment in Los Angeles"},{"url":"https://www.msn.com/en-us/politics/government/appeals-court-temporarily-lifts-judge-s-block-on-trump-s-national-guard-deployment/ar-AA1GCRog","title":"Appeals court temporarily lifts judge's block on Trump's National Guard deployment"},{"url":"https://www.msn.com/en-us/politics/government/judge-to-hear-arguments-in-california-s-showdown-with-trump-administration-over-national-guard/ar-AA1GB9ZC","title":"Judge temporarily blocks Trump administration from activating National Guard troops in LA"}]}},"__N_SSG":true}