{"pageProps":{"postData":{"id":"trump-asserts-federal-control-over-dc-police-deplo","contentHtml":"<h3>Trump Administration Takes Control of D.C. Law Enforcement</h3>\n<p>In a move described by news outlets as an \"extraordinary assertion of presidential power,\" President Donald Trump announced on Monday that he is placing the Washington, D.C. Metropolitan Police Department under federal control. The administration is also deploying approximately 800 National Guard troops to the city.</p>\n<p>During a press conference, President Trump stated the action was a necessary response to a \"wave of lawlessness,\" framing the intervention as a \"historic action to rescue our nation's capital from crime, bloodshed, bedlam and squalor.\"</p>\n<h3>Conflicting Views on Necessity</h3>\n<p>The administration's justification for the move has been met with significant debate. While the White House points to public safety concerns, critics highlight data that presents a different picture. According to a January statement from the Washington, D.C. U.S. Attorney’s Office, data from the Metropolitan Police Department showed that total violent crime in 2024 was down 35% from the previous year, reaching its lowest level in over three decades.</p>\n<p>D.C. Mayor Muriel Bowser called the federal takeover \"unsettling and unprecedented,\" and Senator Dick Durbin characterized it as \"political theater,\" arguing that the city was already making \"dramatic progress\" in reducing violent crime.</p>\n<h3>Public and Political Reaction</h3>\n<p>The decision has generated a mixed but strong reaction. On social media, many have expressed support for the measure as a decisive step toward restoring order. However, there is also considerable opposition, with many questioning the legality and necessity of federalizing a local police force and raising concerns about an overreach of executive power.</p>\n<p>As National Guard troops prepare to deploy in the coming weeks, the move is set to remain a focal point of national debate, highlighting the deep divisions over public safety, federal authority, and the governance of the nation's capital.</p>\n","title":"Trump Asserts Federal Control Over D.C. Police, Deploys National Guard","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-08-11T20:19:16Z","summary":"In an unprecedented move, President Donald Trump has placed the Washington, D.C. Metropolitan Police Department under federal control and ordered the deployment of the National Guard. Citing a need to combat a \"wave of lawlessness,\" the administration's decision marks a significant assertion of presidential power in the nation's capital.","tags":["Donald Trump","Washington D.C.","National Guard","Federal Power","Politics","Law Enforcement"],"sources":[{"url":"https://www.msn.com/en-us/news/us/trump-puts-washington-dc-police-under-federal-control-deploys-national-guard/ar-AA1Kj70M","title":"Trump puts Washington, DC, police under federal control, deploys National Guard"},{"url":"https://www.msn.com/en-us/news/politics/trump-says-he-will-take-control-of-dc-police-deploy-national-guard-to-capital/ar-AA1KjyAy","title":"Trump says he will take control of DC police, deploy National Guard to capital"},{"url":"https://www.msn.com/en-us/news/politics/trump-grabs-control-of-dc-police-promises-national-guard-deployment/ar-AA1KjY3v","title":"Trump Grabs Control of DC Police, Promises National Guard Deployment"},{"url":"https://www.msn.com/en-us/news/us/watch-trump-expected-to-address-dc-crime-in-monday-news-conference/ar-AA1KitCv","title":"LIVE: Trump federalizing DC's Metro Police Dept., deploying National Guard"},{"url":"https://www.msn.com/en-us/politics/government/trump-takes-over-dc-police-in-extraordinary-move-deploys-national-guard-in-capital/ar-AA1KkdEa","title":"Trump takes over DC police in extraordinary move, deploys National Guard in capital"},{"url":"https://www.tennessean.com/story/news/politics/2025/08/11/trump-national-guard-dc-takeover-live-updates/85606803007/?csp=chromepush","title":"Trump orders National Guard into Washington and takes over DC police: Live updates"}]}},"__N_SSG":true}