{"pageProps":{"postData":{"id":"five-soldiers-wounded-in-shooting-at-fort-stewart-","contentHtml":"<p>A Wednesday morning at the Fort Stewart Army base in Georgia turned violent when an active-duty sergeant allegedly opened fire on his fellow soldiers, injuring five before being apprehended.</p>\n<p>The incident occurred just before 11 a.m. in the 2nd Armored Brigade Combat Team area of the base, which is the largest Army installation east of the Mississippi River. According to officials, the suspect, identified as 28-year-old Sgt. Quornelius Radford, used a personal handgun in the attack. The motive for the shooting is still under investigation.</p>\n<p>Fellow soldiers who witnessed the attack acted swiftly, tackling and subduing Radford before he was taken into custody. Their intervention was crucial in preventing further harm. The base was immediately placed on lockdown, which was lifted later in the afternoon once the scene was secured.</p>\n<p>All five wounded soldiers received immediate medical care at the scene and were then transported to local hospitals. Officials reported that three of the soldiers required surgery, but thankfully, all five are expected to recover.</p>\n<p>Sgt. Radford, an automated logistics sergeant, has been assigned to Fort Stewart since 2022 and has no prior deployments or known disciplinary issues, according to military officials. Investigations are ongoing to determine how a personal firearm was brought onto the base.</p>\n<p>The shooting prompted messages of support from public officials. Georgia Governor Brian Kemp stated he was \"saddened by the tragedy,\" while President Donald Trump said, \"The entire nation is praying for the victims and their families.\"</p>\n","title":"Five Soldiers Wounded in Shooting at Fort Stewart; Fellow Sergeant in Custody","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-08-11T01:24:31Z","summary":"An active-duty Army sergeant is in custody after allegedly opening fire and wounding five fellow soldiers at the Fort Stewart base in Georgia. The suspect was quickly subdued by other soldiers, and all victims are expected to recover.","tags":["Fort Stewart","US Army","Georgia","military","shooting"],"sources":[{"url":"https://www.msn.com/en-us/news/us/army-sergeant-in-custody-after-5-soldiers-shot-at-fort-stewart-motive-remains-unknown/ar-AA1K1Hss","title":"Army sergeant in custody after 5 soldiers shot at Fort Stewart, motive remains unknown"},{"url":"https://www.msn.com/en-us/news/us/fort-stewart-shooting-sergeant-allegedly-used-personal-handgun-to-shoot-5-soldiers/ar-AA1K1NG6","title":"5 soldiers injured in shooting at Fort Stewart in Georgia, Army sergeant in custody"},{"url":"https://www.msn.com/en-us/news/us/5-soldiers-shot-by-army-sergeant-at-fort-stewart-in-georgia-officials-say/ar-AA1K5EHk","title":"5 soldiers shot by Army sergeant at Fort Stewart in Georgia, officials say"},{"url":"https://www.scrippsnews.com/us-news/crime/casualties-reported-at-georgia-army-base-following-reports-of-active-shooter","title":"Officials: Army sergeant shot 5 soldiers at Georgia base with personal handgun"}]}},"__N_SSG":true}