{"pageProps":{"postData":{"id":"trump-orders-investigation-into-bidens-cognitive-d","contentHtml":"<p>In a striking move, President Donald Trump has ordered a formal investigation into his predecessor, former President Joe Biden. The directive, outlined in a Wednesday memorandum, specifically targets Biden's alleged \"cognitive decline\" and the reported use of an autopen to sign official documents during his time in office.</p>\n<p>The order calls upon the Department of Justice and the White House counsel to investigate the matter. According to reports, the core accusation behind the investigation is that aides utilized an autopen to conceal Biden's cognitive state and effectively wield presidential authority themselves, raising questions about who was truly in charge of the country.</p>\n<p>While the memorandum initiates the investigation, some reports indicate that it does not clearly specify the legal justification or the precise parameters under which this probe will be conducted.</p>\n<p>The order comes amidst ongoing political tensions and continued public scrutiny regarding the cognitive fitness of both current and former high-profile political figures. Discussions surrounding the topic on social media are simulated to be \"mostly positive, with some debate.\"</p>\n<p>This investigation marks a significant development, injecting a new and potentially contentious element into the political discourse surrounding the past and present administrations.</p>\n","title":"Trump Orders Investigation into Biden's Cognitive Decline and Autopen Use","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-06-05T04:24:39Z","summary":"President Donald Trump has ordered an investigation into former President Joe Biden, citing alleged cognitive decline and the use of an autopen. The directive, issued via memorandum, instructs the Department of Justice and White House counsel to probe who was truly running the country during Biden's term.","tags":["Politics","Donald Trump","Joe Biden","Investigation","Cognitive Decline","Autopen","White House","Department of Justice"]}},"__N_SSG":true}