{"pageProps":{"postData":{"id":"clock-reset-trump-extends-china-tariff-deadline-by","contentHtml":"<h3>Trade War Tensions on Hold as New Deadline is Set</h3>\n<p>In a move that has sent ripples through global markets, the White House announced that President Donald Trump has signed an executive order extending the deadline for imposing higher tariffs on Chinese imports by another 90 days. The decision came just hours before a previous tariff truce was set to expire, averting, for now, a significant escalation in the ongoing trade conflict between the world's two largest economies.</p>\n<p>The official rationale for the extension is to provide a longer runway for negotiators from both Washington and Beijing to hammer out a comprehensive trade deal. For months, the two nations have been locked in a high-stakes standoff over issues ranging from trade imbalances and intellectual property theft to market access. This 90-day pause keeps the current tariff levels in place, providing a fragile stability for businesses and consumers who have been bracing for impact.</p>\n<h3>A Tale of Two Reactions</h3>\n<p>The extension has been met with a mix of relief and skepticism. Many in the business community and on social media have expressed positive sentiment, welcoming the temporary reprieve from what could have been a damaging economic blow. The delay offers hope that a diplomatic solution can still be found, preventing price hikes on consumer goods and further market volatility.</p>\n<p>However, the move is not without its critics. Some political commentators view the extension not as a strategic victory, but as a failure to follow through on the administration's tough talk. On MSNBC, one segment was pointedly titled, \"‘It’s a lie’: Symone calls out Trump’s ‘deals’ as he extends China tariff deadline,\" arguing that the repeated delays undermine the administration's credibility and negotiating position.</p>\n<h3>What Lies Ahead?</h3>\n<p>With the clock now reset, the pressure is back on negotiators to make substantive progress. Key sticking points remain unresolved, and there is no guarantee that a deal will be reached within the new timeframe. The extension has bought time, but the fundamental disagreements that sparked the trade war persist.</p>\n<p>For now, the world watches and waits. The next 90 days will be critical in determining whether the U.S. and China can find common ground or if they are simply postponing an inevitable economic clash.</p>\n","title":"Clock Reset: Trump Extends China Tariff Deadline by 90 Days","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-08-12T04:26:55Z","summary":"In a last-minute move, President Donald Trump has delayed the imposition of higher tariffs on Chinese goods for an additional 90 days, temporarily pausing an escalation in the U.S.-China trade war. The extension is intended to allow for further negotiations, but the decision has drawn mixed reactions.","tags":["US-China Trade War","Tariffs","Donald Trump","International Trade","Economy","Geopolitics"],"sources":[{"url":"https://www.msn.com/en-us/money/markets/trump-extends-china-tariff-deadline-by-another-90-days/ar-AA1KkWv8","title":"Trump extends China tariff deadline by another 90 days"},{"url":"https://www.msnbc.com/the-weeknight/watch/-it-s-a-lie-symone-calls-out-trump-s-deals-as-he-extends-china-tariff-deadline-244752965648","title":"‘It’s a lie’: Symone calls out Trump’s ‘deals’ as he extends China tariff deadline"},{"url":"https://www3.nhk.or.jp/nhkworld/en/news/20250812_11/","title":"US, China extend tariff deadlines for another 90 days"}]}},"__N_SSG":true}