{"pageProps":{"postData":{"id":"disney-to-pay-almost-439-million-to-take-full-cont","contentHtml":"<p>In a significant move solidifying its streaming future, The Walt Disney Company has agreed to pay Comcast an additional $438.7 million (or almost $439 million) to acquire Comcast's remaining one-third stake in the Hulu streaming service.</p>\n<p>This payment resolves a lengthy, multi-year valuation process. Following an initial agreement in late 2023 where Disney committed to pay at least $8.6 billion for the stake based on a guaranteed floor value, an appraisal process was conducted. The final $438.7 million payment is the result of this appraisal, bringing Disney's total investment to secure full ownership.</p>\n<p>Disney had held a majority stake and managed the service since 2019, with Comcast effectively becoming a silent partner. The transaction is anticipated to close by late July.</p>\n<p>The acquisition paves the way for deeper integration of Hulu's general entertainment content with Disney+ and, eventually, ESPN's direct-to-consumer product, according to Disney CEO Bob Iger. This strategic alignment aims to create a more comprehensive and valuable offering for consumers in the competitive streaming landscape.</p>\n<p>Hulu was originally founded in 2007 as a joint venture by entertainment giants looking to establish an online presence for their TV content. Disney joined in 2009 and gained majority control after acquiring 21st Century Fox.</p>\n<p>While the deal finalizes Disney's control, Comcast will now focus on its primary streaming service, Peacock. Social sentiment around the acquisition appears mostly positive, although some debate exists on social media platforms.</p>\n","title":"Disney to pay almost $439 million to take full control of streaming service Hulu","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-06-10T16:21:44Z","summary":"Disney is set to pay Comcast an additional $438.7 million to acquire the remaining stake in the streaming service Hulu, finalizing a long-awaited move that gives Disney full ownership.","tags":["Disney","Hulu","Streaming","Acquisition","Entertainment","Comcast","Media"],"sources":[{"url":"https://www.courant.com/2025/06/10/disney-deal-full-control-hulu/","title":"Disney to pay almost $439 million to take full control of streaming service Hulu"},{"url":"https://www.advanced-television.com/2025/06/10/disney-gets-hulu-for-439m/","title":"Disney gets Hulu for $439m"}]}},"__N_SSG":true}