{"pageProps":{"postData":{"id":"colombian-president-vows-to-hunt-mastermind-behind","contentHtml":"<p>Colombian Senator Miguel Uribe, who is reportedly in the running for next year's presidential race, was shot and critically injured during a campaign event in the capital city of Bogota. Authorities have confirmed the arrest of a 15-year-old suspect in connection with the shooting.</p>\n<p>The attack has drawn a strong reaction from the highest levels of Colombian government. The nation's president has publicly vowed to launch a hunt for the 'mastermind' believed to have orchestrated the shooting, signaling a determination to pursue those beyond the immediate suspect.</p>\n<p>Senator Uribe's critical condition following the incident highlights the ongoing concerns surrounding political stability and violence in Colombia, particularly as the country approaches its next election cycle. The incident and the president's subsequent declaration underscore the gravity of the situation and the potential implications for the political landscape.</p>\n","title":"Colombian president vows to hunt 'mastermind' behind shooting of political rival, after 15-year-old arrested","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-06-08T11:12:38Z","summary":"Colombian Senator Miguel Uribe, a potential presidential candidate, is in critical condition after being shot in Bogota. A 15-year-old suspect has been arrested, prompting the nation's president to vow to find the attack's 'mastermind,' raising concerns about political violence.","tags":["Colombia","Politics","Crime","Shooting","Miguel Uribe","President","Bogota"],"sources":[{"url":"https://www.msn.com/en-us/news/world/colombian-president-vows-to-hunt-mastermind-behind-shooting-of-political-rival-after-15-year-old-arrested/ar-AA1GhFqU","title":"Colombian president vows to hunt 'mastermind' behind shooting of political rival, after 15-year-old arrested"},{"url":"https://www.msn.com/en-gb/crime/general/colombian-presidential-candidate-in-critical-condition-after-shooting-as-15-year-old-suspect-arrested/ar-AA1GilyY","title":"Colombian presidential candidate in 'critical condition' after shooting - as 15-year-old suspect arrested"},{"url":"https://www.msn.com/en-in/politics/government/video-colombian-presidential-candidate-shot-in-head-during-rally/ar-AA1GhRFF","title":"Video: Colombian Presidential Candidate Shot In Head During Rally"}]}},"__N_SSG":true}