{"pageProps":{"postData":{"id":"inside-the-courthouse-arrests-a-new-front-in-trump","contentHtml":"<p>The landscape of immigration enforcement appears to be shifting under the Trump administration, with a new tactic reportedly taking root: conducting arrests directly at courthouses. According to recent reports, U.S. Immigration and Customs Enforcement (ICE) officers are being instructed to apprehend individuals immediately after a judge has ordered their deportation or even after prosecutors have moved to drop their cases.</p>\n<p>This marks a notable shift, bringing immigration enforcement into spaces traditionally seen as neutral ground for legal proceedings. Operations involving these courthouse arrests have been reported in multiple U.S. cities, and early indications suggest they may be specifically targeting individuals who have been in the country for less than two years.</p>\n<p>Advocates and attorneys note that this tactic has rattled people appearing for hearings and is creating additional challenges within the already complex immigration system. It is seen by many as a coordinated effort aimed at fulfilling the administration's broader pledge for increased arrests and deportations.</p>\n<p>While the full scope and impact of this strategy are still unfolding, its implementation at courthouses signals an expansion of enforcement tactics, directly impacting individuals navigating the legal system.</p>\n<p>This development highlights the aggressive push towards deportation and the evolving methods being employed by immigration authorities.</p>\n","title":"Inside the Courthouse Arrests: A New Front in Trump's Deportation Strategy","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-05-24T02:25:45Z","summary":"A new tactic is emerging in the Trump administration's deportation efforts: U.S. Immigration and Customs Enforcement (ICE) is reportedly conducting arrests at courthouses, targeting individuals immediately after immigration court hearings.","tags":["Immigration Enforcement","ICE","Deportation","Trump Administration","Courthouse Arrests","Immigration Law","US Politics"]}},"__N_SSG":true}