{"pageProps":{"postData":{"id":"mass-arrests-in-la-as-police-enforce-downtown-curf","contentHtml":"<p>Los Angeles authorities initiated mass arrests in the downtown area after a curfew, ordered by Mayor Karen Bass, took effect. The measure was put in place as a response to ongoing looting and vandalism that occurred amidst protests against recent federal immigration crackdowns under President Trump's administration.</p>\n<p>Police were quick to enforce the curfew, making arrests shortly after the designated time and employing crowd control tactics against demonstrators who defied the order.</p>\n<p>The situation drew commentary from California Governor Gavin Newsom, who reportedly described the federal government's handling of the anti-immigration raid protests as \"purposefully inflammatory.\"</p>\n<p>Initial social media reactions to the mass arrests and curfew appear to be largely positive, though some debate is also present.</p>\n","title":"Mass Arrests in LA as Police Enforce Downtown Curfew Amidst Protests","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-06-11T12:33:14Z","summary":"Los Angeles police have conducted mass arrests after Mayor Karen Bass implemented a downtown curfew to address looting and vandalism during protests against federal immigration crackdowns. Authorities swiftly enforced the order, while California's governor criticized the federal response.","tags":["Los Angeles","curfew","mass arrests","protests","immigration","law enforcement","Karen Bass","Gavin Newsom"],"sources":[{"url":"https://www.msn.com/en-us/news/us/la-police-make-mass-arrests-after-downtown-curfew-kicks-in-live-updates/ar-AA1Gv6Xa","title":"MSN"},{"url":"https://www.bbc.com/news/live/cgr5vgexj1gt?post=asset:6bcc5571-5fd3-47db-b079-8d5a483ff03d","title":"BBC News - US Politics"},{"url":"https://www.usatoday.com/videos/news/2025/06/11/protesters-defy-curfew-order-from-la-mayor-police-make-mass-arrests/84146491007/","title":"Protesters defy curfew order from LA Mayor Bass; police make mass arrests"},{"url":"https://www.cnn.com/us/live-news/la-protests-ice-raids-trump-06-11-25","title":"Live updates: Protests against Trump's immigration crackdown continue across the US"},{"url":"https://www.msn.com/en-us/news/us/la-police-swiftly-enforce-downtown-curfew-as-protests-against-trump-s-immigration-crackdown-continue/ar-AA1Gu1Gz","title":"MSN"}]}},"__N_SSG":true}