{"pageProps":{"postData":{"id":"state-department-starts-firing-more-than-1350-work","contentHtml":"<p>In a major move impacting the United States' diplomatic ranks, the State Department has commenced the process of firing more than 1,350 U.S.-based employees. This significant personnel reduction is part of what the Trump administration describes as an \"unprecedented overhaul\" aimed at aligning the diplomatic corps with an \"America First\" agenda and shrinking the federal bureaucracy. The move reportedly follows President Trump's order to Secretary of State Marco Rubio to revamp the foreign service.</p>\n<p>The layoffs affect both civil service and foreign service officers stationed in the United States. According to internal notices, the department is streamlining domestic operations by targeting \"non-core functions, duplicative or redundant offices, and offices where considerable efficiencies may be found.\"</p>\n<p>This shake-up comes at a critical juncture on the world stage, with the U.S. navigating complex international issues, including conflicts in Ukraine and Gaza, heightened tensions between Israel and Iran, and the increasing global influence of China. Critics argue that this mass dismissal of experienced diplomats could undermine the country's ability to effectively defend and promote its interests abroad and counter the growing assertiveness of rivals like China and Russia. Democratic lawmakers have voiced strong opposition, stating the decision makes America \"less safe and less secure.\"</p>\n<p>The total reduction in the U.S.-based workforce is expected to reach nearly 3,000 when including voluntary departures, out of approximately 18,000 domestic employees. The move follows a recent Supreme Court decision that cleared the way for the administration to proceed with these job cuts and broader agency downsizing.</p>\n<p>Analysis of social sentiment on the topic suggests a mixed reaction, reportedly leaning 'mostly positive' but with 'some debate'.</p>\n","title":"State Department starts firing more than 1,350 workers in Trump's shake-up of diplomatic corps","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-07-11T20:19:00Z","summary":"The U.S. State Department has begun terminating the employment of over 1,350 U.S.-based workers as part of the Trump administration's significant restructuring of its diplomatic corps, a move framed as an \"America First\" initiative.","tags":["Politics","State Department","Trump Administration","Diplomatic Corps","US Foreign Policy","Layoffs","Government Reform"],"sources":[{"url":"https://www.msn.com/en-us/news/us/state-department-starts-firing-more-than-1350-workers-in-trumps-shake-up-of-diplomatic-corps/ar-AA1Iqmjn","title":"MSN"},{"url":"https://www.msn.com/en-us/news/us/state-department-starts-firing-more-than-1350-workers-in-trumps-shake-up-of-diplomatic-corps/ar-AA1Iq7LU","title":"MSN"},{"url":"https://www.scmp.com/news/world/united-states-canada/article/3317946/us-state-department-starts-firing-over-1350-workers-trump-shake","title":"US State Department starts firing over 1,350 workers in Trump shake-up"},{"url":"https://www.staradvertiser.com/2025/07/11/breaking-news/trump-begins-mass-state-department-firings-in-major-shake-up/","title":"Error scraping https://www.staradvertiser.com/2025/07/11/breaking-news/trump-begins-mass-state-department-firings-in-major-shake-up/: 403 Client Error: Forbidden for url: https://www.staradvertiser.com/2025/07/11/breaking-news/trump-begins-mass-state-department-firings-in-major-shake-up/"},{"url":"https://www.msn.com/en-us/news/politics/state-dept-set-to-layoff-hundreds-of-employees-as-restructuring-begins/ar-AA1IqXw4","title":"MSN"},{"url":"https://tribune.com.pk/story/2555376/us-state-dept-to-fire-1350-staffers-in-diplomatic-overhaul","title":"US State Dept to fire 1,350 staffers in diplomatic overhaul"}]}},"__N_SSG":true}