{"pageProps":{"postData":{"id":"the-kadrey-v-meta-fair-use-ruling-is-just-the-star","contentHtml":"<p>In a closely watched legal battle over artificial intelligence and copyright, Meta Platforms Inc. has received a favorable ruling in the case of 'Kadrey, et al. v. Meta Platforms Inc.' A federal judge granted Meta summary judgment, finding that the plaintiff authors did not provide sufficient evidence that Meta's use of their copyrighted books to train its AI models constituted harmful fair use.</p>\n<p>This decision marks the second time this week that a major AI company has fended off a similar lawsuit from authors, following a comparable ruling in favor of Anthropic. While a win for Meta, the presiding judge, U.S. District Judge Vince Chhabria, notably described his own ruling as being in \"significant tension with reality,\" highlighting the complex and perhaps rapidly evolving nature of applying existing copyright law to novel AI technologies.</p>\n<p>The ruling underscores the significant legal hurdles authors and other creators face in proving direct harm or market impact from their work being included in large datasets used to train AI models. However, the judge's comments suggest that while Meta may have won this round on current legal interpretations and presented evidence, the fundamental questions about AI training data and intellectual property remain unresolved.</p>\n<p>This outcome is likely just one skirmish in what is expected to be a protracted and complex legal conflict as courts grapple with how to apply traditional copyright principles to the transformative capabilities and data demands of artificial intelligence.</p>\n","title":"The 'Kadrey v. Meta' fair use ruling is just the start of a long, complex AI copyright battle","authors":[{"username":"@alanaturner","name":"Alana Turner"}],"date":"2025-06-27T20:24:18Z","summary":"Meta secures a win in the \"Kadrey v. Meta\" AI copyright case regarding the use of books for training, but the judge acknowledges the ruling is in \"significant tension with reality,\" signaling that the broader legal fight over AI and intellectual property is far from over.","tags":["AI","Copyright","Fair Use","Meta","Litigation","Intellectual Property"],"sources":[{"url":"https://www.msn.com/en-us/technology/artificial-intelligence/the-kadrey-v-meta-fair-use-ruling-is-just-the-start-of-a-long-complex-ai-copyright-battle/ar-AA1HyCSB","title":"The 'Kadrey v. Meta' fair use ruling is just the start of a long, complex AI copyright battle"},{"url":"https://www.msn.com/en-us/news/crime/judge-in-kadrey-v-meta-ai-copyright-case-rules-for-meta-against-authors/ar-AA1HsiKD","title":"Judge in 'Kadrey v. Meta' AI copyright case rules for Meta, against authors"},{"url":"https://news.bloomberglaw.com/litigation/meta-also-wins-claims-over-copyright-removal-in-authors-ai-suit","title":"Meta Also Wins Claims Over Copyright Removal in Authors’ AI Suit"},{"url":"https://www.wired.com/story/meta-scores-victory-ai-copyright-case/","title":"Meta Wins Blockbuster AI Copyright Case—but There’s a Catch"},{"url":"https://hoodline.com/2025/06/san-francisco-judge-rules-in-favor-of-meta-in-ai-copyright-infringement-case/","title":"San Francisco Judge Rules in Favor of Meta in AI Copyright Infringement Case"}]}},"__N_SSG":true}