{"pageProps":{"postData":{"id":"trump-administration-agrees-to-nearly-5-million-se","contentHtml":"<p>News has emerged that the Trump administration is set to pay nearly $5 million to settle a wrongful death lawsuit brought by the family of Ashli Babbitt. Babbitt was shot and killed by a U.S. Capitol Police officer while attempting to breach a barricaded door during the January 6, 2021, riot at the U.S. Capitol.</p>\n<p>The settlement, confirmed by multiple news sources, resolves the lawsuit filed by Babbitt's family against the federal government. The specific details of the settlement agreement have not been fully disclosed, but the reported amount is close to $5 million.</p>\n<p>Sources familiar with the matter have described the payout as a significant or extraordinary concession by the Justice Department, particularly given that the department has prosecuted hundreds of other individuals involved in the Capitol riot.</p>\n<p>The fatal shooting of Ashli Babbitt has been a highly debated topic since January 6th, becoming a focal point for various political narratives surrounding the events of that day. While federal investigations previously cleared the officer involved, the civil lawsuit brought by Babbitt's family sought accountability and damages.</p>\n<p>Social media sentiment regarding the settlement appears to be mostly positive, reflecting support for Babbitt's family, though some debate surrounding the circumstances of her death and the settlement amount is also present.</p>\n","title":"Trump Administration Agrees to Nearly $5 Million Settlement in Ashli Babbitt Wrongful Death Suit","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-05-19T23:11:57Z","summary":"The Trump administration has reached an agreement to pay close to $5 million to settle a wrongful death lawsuit filed by the family of Ashli Babbitt, who was fatally shot during the January 6th Capitol riot.","tags":["Ashli Babbitt","Jan 6th","Capitol riot","settlement","wrongful death","Trump administration","Justice Department"]}},"__N_SSG":true}