{"pageProps":{"postData":{"id":"trump-administration-delays-tiktok-ban-for-third-t","contentHtml":"<p>President Donald Trump has once again pushed back the deadline for the popular video-sharing app TikTok to comply with a law requiring its Chinese parent company, ByteDance, to sell its U.S. operations or face a ban. On Thursday, the President signed an executive order granting a 90-day extension, moving the deadline to September.</p>\n<p>This latest delay is the third time the Trump administration has extended the deadline since the law was passed by Congress. The stated goal remains to allow more time to broker a deal that would bring TikTok under American ownership.</p>\n<p>The move comes amidst ongoing discussions about the future of the platform in the United States and its potential national security implications. While there is some debate surrounding the decision, simulated social media sentiment suggests a mostly positive reaction to the delay.</p>\n","title":"Trump Administration Delays TikTok Ban for Third Time, Seeking American Ownership Deal","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-06-19T16:20:05Z","summary":"President Trump has signed an executive order extending the deadline for TikTok to find an American buyer by another 90 days, marking the third such delay as the administration seeks a resolution for the popular social media platform.","tags":["TikTok","Donald Trump","Executive Order","ByteDance","Technology","Social Media","US Politics"],"sources":[{"url":"https://www.msn.com/en-us/news/politics/trump-says-he-signed-an-executive-order-delaying-a-ban-on-tiktok/ar-AA1H2DtH","title":"Trump says he signed an executive order delaying a ban on TikTok"},{"url":"https://www.msn.com/en-us/news/politics/trump-extends-tiktok-enforcement-ban-deadline-another-90-days/ar-AA1GUoye","title":"Trump extends TikTok enforcement ban deadline another 90 days"},{"url":"https://www.msn.com/en-us/news/politics/trump-delays-tiktok-ban-deadline-again/ar-AA1H2yNz","title":"Trump delays TikTok ban deadline again"},{"url":"https://www.pbs.org/newshour/politics/trump-signs-new-executive-order-delaying-tiktok-ban-for-third-time","title":"Trump signs new executive order delaying TikTok ban for third time"},{"url":"https://www.businessinsider.com/trump-set-to-give-tiktok-90-more-days-find-deal-2025-6","title":"Trump gives TikTok 90 more days to avoid a US ban"}]}},"__N_SSG":true}