{"pageProps":{"postData":{"id":"trump-lashes-out-at-judges-and-federalist-society-","contentHtml":"<p>Former President Donald Trump is reportedly lashing out at federal judges who have issued rulings unfavorable to his tariff policies, according to recent news reports.</p>\n<p>Adding another layer to his criticism, Trump is also blaming the conservative legal organization, the Federalist Society, a group he heavily relied upon for judicial recommendations during his presidency, including for Supreme Court appointments.</p>\n<p>Trump's frustration stems from court decisions that have challenged the legality of some of the tariffs implemented during his administration. He is now attributing these adverse rulings to what he calls \"bad legal advice\" provided by the Federalist Society regarding the selection of judges.</p>\n<p>This public criticism marks a notable shift in Trump's relationship with the influential group that played a significant role in shaping the federal judiciary during his term. While he previously hailed the Federalist Society's guidance in appointing conservative judges, he now appears to view their recommendations as detrimental when those same judges rule against his executive actions, specifically on trade.</p>\n<p>The move highlights the ongoing tensions between executive power, judicial review, and trade policy. It also underscores the complexities of judicial appointments, even when guided by ideological alignment, as judges are expected to rule based on law, which may not always align with the political objectives of the president who appointed them.</p>\n<p>The reaction to Trump's comments appears mixed, sparking debate across various platforms.</p>\n","title":"Trump Lashes Out at Judges and Federalist Society Over Tariff Rulings","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-05-30T04:20:59Z","summary":"Former President Trump is reportedly criticizing federal judges who have ruled against his tariff policies and placing blame on the conservative legal group, the Federalist Society, for providing \"bad legal advice\" on judicial nominations.","tags":["Donald Trump","Tariffs","Federalist Society","Judiciary","Politics","Trade Policy"]}},"__N_SSG":true}