{"pageProps":{"postData":{"id":"wisconsin-supreme-court-clears-path-for-conversion","contentHtml":"<p>In a significant decision, the Wisconsin Supreme Court has removed a major roadblock preventing a statewide ban on conversion therapy from being enacted. The court ruled that a Republican-controlled legislative committee acted unconstitutionally when it repeatedly blocked a proposed rule from a state agency that would prohibit the controversial practice for LGBTQ+ individuals.</p>\n<p>The ban was initially developed in 2020 by the Wisconsin Department of Safety and Professional Services. However, the Legislature's Joint Committee for Review of Administrative Rules consistently voted against the rule, effectively halting its implementation.</p>\n<p>The liberal-controlled Supreme Court's ruling asserts that the legislative committee exceeded its powers by preventing the agency's rule from taking effect. This decision rebalances the power dynamics between the executive branch (which developed the rule) and the legislative branch, paving the way for the ban to finally be implemented across Wisconsin.</p>\n<p>Conversion therapy, often described as a range of practices aimed at changing an individual's sexual orientation or gender identity, is widely discredited by major medical and mental health organizations. Critics argue the practice is ineffective and harmful, particularly to vulnerable youth.</p>\n<p>The court's decision has been met with varied reactions. While social sentiment appears to be mostly positive, reflecting support for the ban and protection of LGBTQ+ youth, some debate surrounding the ruling and the practice itself persists.</p>\n","title":"Wisconsin Supreme Court Clears Path for Conversion Therapy Ban","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-07-08T16:21:17Z","summary":"A long-stalled statewide ban on conversion therapy for LGBTQ+ individuals in Wisconsin can now move forward after the state's Supreme Court ruled that a legislative committee overstepped its authority in blocking the measure.","tags":["Wisconsin","Supreme Court","Conversion Therapy","LGBTQ+","Politics","Legislation","Civil Rights"],"sources":[{"url":"https://www.msn.com/en-us/news/politics/wisconsin-supreme-court-clears-the-way-for-a-conversion-therapy-ban-to-be-enacted/ar-AA1Ic1Zk","title":"MSN"},{"url":"https://www.msn.com/en-us/news/politics/wisconsin-supreme-court-rules-evers-can-ban-conversion-therapy-reins-in-power-of-the-legislature/ar-AA1Icf0F","title":"MSN"},{"url":"https://madison.com/news/state-regional/government-politics/article_90763a9e-0a75-472e-ba53-c6e72cf1ae4e.html","title":"Wisconsin Supreme Court ruling would allow for statewide ban on conversion therapy"},{"url":"https://www.msn.com/en-us/politics/government/wisconsin-supreme-court-rules-in-favor-of-conversion-therapy-ban/ar-AA1Icot2","title":"MSN"}]}},"__N_SSG":true}