{"pageProps":{"postData":{"id":"federal-judge-blocks-trump-administrations-medicai","contentHtml":"<p>A federal judge in Boston has granted a nationwide preliminary injunction, temporarily blocking the Trump administration from enforcing a provision that would cut Medicaid funding to Planned Parenthood.</p>\n<p>The ruling, issued by U.S. District Judge Indira Talwani, ensures that Planned Parenthood’s approximately 600 health centers can continue to be reimbursed for Medicaid services while the organization's lawsuit against the government proceeds. The decision expands on a previous, more limited order, now offering protection to all of the organization's affiliates.</p>\n<p>The controversial provision was part of a major tax and spending package recently signed into law by President Donald Trump. The law sought to pause Medicaid reimbursements for one year to centers that offer abortion services.</p>\n<p>In her ruling, Judge Talwani stated that Planned Parenthood is likely to succeed in its claim that the law's targeted exclusion of the organization violates the U.S. Constitution. The judge found that the provision amounted to a “targeted exclusion” of the healthcare provider.</p>\n<p>Planned Parenthood President and CEO Alexis McGill Johnson praised the decision in a statement, saying the order ensures “patients across the country can still go to their trusted Planned Parenthood provider for care using Medicaid.” The organization had warned that the funding cuts would force clinic closures and severely limit community access to essential services like low-cost contraception, STI testing, and cancer screenings.</p>\n<p>The Department of Health and Human Services (HHS) has already appealed the judge's initial order, signaling that the legal battle is far from over. The case will now proceed to the U.S. Court of Appeals for the First Circuit.</p>\n","title":"Federal Judge Blocks Trump Administration's Medicaid Cuts to Planned Parenthood","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-07-28T16:25:39Z","summary":"A federal judge has issued a nationwide preliminary injunction, temporarily halting a provision in President Trump's new tax and spending law that would have cut Medicaid funding to Planned Parenthood affiliates across the country.","tags":["Politics","Healthcare","Planned Parenthood","Trump Administration","Law","Medicaid"],"sources":[{"url":"https://www.msn.com/en-us/news/us/us-judge-blocks-trump-backed-medicaid-cuts-to-planned-parenthood/ar-AA1JrCaT","title":"US judge blocks Trump-backed Medicaid cuts to Planned Parenthood"},{"url":"https://www.msn.com/en-us/news/us/judge-blocks-trump-administrations-efforts-to-defund-planned-parenthood/ar-AA1JrPQd","title":"Judge blocks Trump administration's efforts to defund Planned Parenthood"},{"url":"https://www.msn.com/en-us/news/other/donald-trump-s-cuts-to-planned-parenthood-get-blocked/ar-AA1JrVae","title":"Donald Trump's cuts to Planned Parenthood get blocked"},{"url":"https://news.bloomberglaw.com/health-law-and-business/judge-pauses-medicaid-cuts-to-all-planned-parenthood-affiliates","title":"Judge Pauses Medicaid Cuts to All Planned Parenthood Affiliates"},{"url":"https://www.msn.com/en-us/news/politics/judge-blocks-trump-administration-from-cutting-planned-parenthood-funding/ar-AA1J1F3y","title":"Judge blocks Trump administration from cutting Planned Parenthood funding"}]}},"__N_SSG":true}