{"pageProps":{"postData":{"id":"classic-apps-smarter-tools-microsoft-infuses-notep","contentHtml":"<p>Get ready to see some classic Windows applications in a whole new light. Microsoft is rolling out a suite of generative AI features to its core Windows 11 tools – Notepad, Paint, and the Snipping Tool – for users in the Windows Insider program's Canary and Dev channels, with a focus on Copilot Plus PCs.</p>\n<p>This update aims to make everyday computing tasks smarter and more efficient by embedding AI directly into the utilities many Windows users rely on daily.</p>\n<h2>Notepad Gets a Writing Boost</h2>\n<p>The humble Notepad is perhaps the most surprising recipient of AI enhancements. A new \"Write\" feature is being introduced, allowing users to generate text based on prompts or receive AI-powered assistance to build upon existing content. Accessed via the Windows Copilot menu, this feature adds generative capabilities alongside previously tested AI tools like \"Summarize\" (to get a quick summary of a document) and \"Rewrite\" (to adjust tone, length, or rephrase text).</p>\n<h2>Paint Becomes an AI Art Companion</h2>\n<p>Microsoft Paint isn't left out, gaining creative AI powers. Joining existing features like Generative Fill and Generative Erase is a new \"Sticker generator\" that can create custom stickers based on text descriptions. Additionally, an \"Object select\" tool uses AI to intelligently identify and select elements within an image, simplifying editing and manipulation.</p>\n<h2>Snipping Tool Takes Perfect Screenshots</h2>\n<p>The Snipping Tool is also getting smarter. A \"Perfect screenshot\" button will leverage AI to automatically resize your selection area based on the content it detects, aiming to make capturing exactly what you need quicker and easier. It's also gaining a new Color picker feature, displaying HEX, RGB, and HSL color values with an eyedropper tool for greater precision.</p>\n<h2>Requirements and Availability</h2>\n<p>These new features are currently available to Windows Insiders in the Canary and Dev channels and appear particularly tailored for the new Copilot Plus PCs. Users will need to be signed into their Microsoft account to use the Notepad \"Write\" feature, which will operate on a credit system similar to other AI-powered Windows functionalities (though pricing details for these credits are not yet announced).</p>\n<p>This move signifies Microsoft's broader strategy to weave AI capabilities directly into the fabric of the Windows operating system, turning familiar, simple tools into more powerful, assisted applications.</p>\n","title":"Classic Apps, Smarter Tools: Microsoft Infuses Notepad, Paint, and Snipping Tool with Generative AI","authors":[{"username":"@alanaturner","name":"Alana Turner"}],"date":"2025-05-22T19:16:35Z","summary":"Microsoft is bringing generative AI to familiar Windows tools like Notepad, Paint, and the Snipping Tool for Windows Insiders, adding features like AI-powered text generation, smart image selections, and automated screenshot resizing.","tags":["Microsoft","Windows 11","Generative AI","Notepad","Paint","Snipping Tool","Copilot Plus PCs","Windows Insiders","AI Features"]}},"__N_SSG":true}