{"pageProps":{"postData":{"id":"the-new-vc-playbook-khosla-ventures-and-others-exp","contentHtml":"<p>Venture capitalists have long been associated with backing high-growth startups aiming to revolutionize industries or create entirely new markets. But a new trend is emerging in the VC landscape: acquiring mature businesses and applying cutting-edge artificial intelligence to optimize their operations.</p>\n<p>This strategy, drawing parallels to private equity roll-ups, involves firms purchasing established companies – ranging from call centers and accounting firms to professional service providers – and integrating AI technologies to enhance efficiency, automate processes, and expand customer reach.</p>\n<p>Firms like General Catalyst, Thrive Capital, and solo VC Elad Gil are reportedly exploring or already implementing this approach. General Catalyst, in particular, is positioning this as a distinct new asset class.</p>\n<p>Adding to this trend, Khosla Ventures, known for its early and often audacious bets on frontier technology, is also considering these AI-infused roll-up opportunities. Samir Kaul, a general partner at Khosla Ventures, indicated the firm is looking at a few such deals, albeit with a degree of caution.</p>\n<p>\"The companies we’re looking at are very unlikely to lose money,\" Kaul told TechCrunch, emphasizing the need to maintain the firm's strong return track record. Khosla Ventures plans to \"dabble\" initially to assess returns before potentially committing further or even raising a specific fund for this strategy. If they scale this approach, they would likely partner with a PE-style firm for acquisition expertise rather than building an internal team.</p>\n<p>One intriguing potential benefit of this strategy is the direct access it could provide to AI startups. By marrying old businesses with new technology, VCs can create large, established client bases for the AI companies in which they are also invested. This could significantly ease the challenge many AI startups face in securing enterprise customers, especially given the rapid pace of AI development and historically long enterprise sales cycles.</p>\n<p>This evolving investment model signals a shift in how VCs perceive and apply artificial intelligence, viewing it not just as a tool for nascent disruptors but also as a powerful lever to revitalize and scale existing, profitable businesses. As VCs continue to experiment, these AI-infused roll-ups could become a more prominent feature of the investment landscape.</p>\n","title":"The New VC Playbook: Khosla Ventures and Others Explore AI-Infused Roll-ups of Mature Businesses","authors":[{"username":"@alanaturner","name":"Alana Turner"}],"date":"2025-05-23T22:18:43Z","summary":"Venture capital firms, traditionally focused on funding disruptive startups, are now experimenting with a new strategy: acquiring established, mature companies and turbocharging them with artificial intelligence for increased efficiency and scale.","tags":["Venture Capital","AI","Investment Strategy","Khosla Ventures","Private Equity","Business Acquisition","Efficiency","Automation"]}},"__N_SSG":true}