{"pageProps":{"postData":{"id":"intel-in-the-crosshairs-new-ceo-battles-trump-chin","contentHtml":"<h3>A Battle on Two Fronts for Intel's New Chief</h3>\n<p>Intel, the American semiconductor giant, is facing a tumultuous period as its new CEO, Lip-Bu Tan, finds himself at the center of a political and corporate firestorm. Just months after taking the helm from former CEO Patrick Gelsinger, Tan is grappling with a public attack from former President Donald Trump and Republican senators, all while dealing with pre-existing tensions within his own boardroom.</p>\n<h3>The Political Attack from Washington</h3>\n<p>The external pressure escalated significantly when former President Trump publicly demanded Tan's resignation, labeling him as \"highly conflicted\" due to his previous business connections with Chinese firms. This sentiment was echoed by Republican Senators Tom Cotton and Bernie Moreno, who have voiced concerns that these ties could pose a risk to national security. The accusations have cast a harsh spotlight on Tan's leadership at a company critical to U.S. technological sovereignty.</p>\n<h3>Compounded by Internal Friction</h3>\n<p>This assault from Washington isn't happening in a vacuum. Reports indicate that Tan was already at odds with Intel's board before the political pressure mounted. A key point of contention is reportedly the company's crucial next-generation 18A chipmaking process. Tan, who initiated a series of cuts to refocus the company since taking over in March, has expressed concerns about the process, creating friction with company leadership who see manufacturing as a core part of Intel's identity.</p>\n<h3>The Gelsinger Twist</h3>\n<p>Adding another layer of complexity to the saga is the re-emergence of former CEO Patrick Gelsinger. In a striking move, Gelsinger recently penned an op-ed in <em>The Wall Street Journal</em> publicly backing a Trump administration plan to establish a U.S. sovereign wealth fund. The fund's goal is to boost the American tech sector's ability to compete with China. By aligning himself with the very administration that is publicly attacking his successor, Gelsinger has created a fascinating and deeply ironic subplot in this corporate drama.</p>\n<h3>The Road Ahead</h3>\n<p>Intel's board is publicly standing by Tan for now, but the dual pressures from political critics and internal dissent place him in an incredibly vulnerable position. The ongoing controversy has already impacted Intel's stock, wiping out the gains seen after Tan's appointment. The unfolding situation raises critical questions about the intersection of politics and corporate governance, the future of U.S.-China tech competition, and whether Intel's new leader can navigate a crisis that threatens to unravel his tenure before it has truly begun.</p>\n","title":"Intel in the Crosshairs: New CEO Battles Trump, China Accusations, and Internal Dissent","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-08-08T01:23:58Z","summary":"Intel's new CEO, Lip-Bu Tan, finds himself in a precarious position, battling public demands for his resignation from former President Trump over China ties while simultaneously navigating friction with his own board. The situation is further complicated by the public re-emergence of his predecessor, Pat Gelsinger, who appears to be aligning with the Trump administration.","tags":["Intel","Donald Trump","Lip-Bu Tan","Patrick Gelsinger","US Politics","Tech Industry","US-China Relations","Corporate Governance"],"sources":[{"url":"https://www.msn.com/en-us/money/companies/intel-s-ceo-under-attack-from-trump-is-already-at-odds-with-his-board/ar-AA1K7ixM","title":"Intel's CEO, Under Attack From Trump, Is Already at Odds With His Board"},{"url":"https://www.msn.com/en-gb/politics/government/trump-demands-highly-conflicted-intel-ceo-resign-over-china-ties/ar-AA1K7liz","title":"Trump demands 'highly conflicted' Intel CEO resign over China ties"},{"url":"https://9to5mac.com/2025/08/07/intels-ceo-lip-bu-tan-under-fire-amid-washington-backlash-and-board-friction/","title":"Intel’s CEO Lip-Bu Tan under fire amid Washington backlash and board friction"},{"url":"https://www.aol.com/ex-intel-ceo-backs-trumps-110133284.html","title":"Ex-Intel CEO backs Trump's sovereign wealth fund plan - AOL"},{"url":"https://www.techrepublic.com/article/news-intel-ceo-lipbu-tan-18a-chipmaking-process/","title":"Intel CEO Deliberates Major Manufacturing Overhaul - and Possibly ..."}]}},"__N_SSG":true}