{"pageProps":{"postData":{"id":"uche-ojeh-husband-of-today-shows-sheinelle-jones-d","contentHtml":"<p>The \"Today\" show family and viewers are mourning the loss of Uche Ojeh, the husband of co-host Sheinelle Jones, who has died at the age of 45.</p>\n<p>His passing was announced on the morning show, revealing that Ojeh had succumbed to glioblastoma, a highly aggressive form of brain cancer. The news comes after Jones had previously taken time away from the show to be with her family as they navigated his health battle.</p>\n<p>During the emotional announcement, Sheinelle's co-hosts shared their profound sadness and spoke to her remarkable strength throughout Ojeh's illness. Tributes highlighted Uche Ojeh as a devoted husband and loving father, celebrating the joy and warmth he brought to those around him.</p>\n<p>The news has prompted an outpouring of support for Sheinelle Jones and her family online, with many offering condolences and sharing messages of sympathy. Simulated social media sentiment reflects this, showing largely positive reactions and expressions of solidarity for the grieving journalist.</p>\n<p>Uche Ojeh and Sheinelle Jones were married for 17 years and shared three children. Their family's journey through his illness and now his passing serves as a somber reminder of the devastating impact of glioblastoma.</p>\n","title":"Uche Ojeh, Husband of 'Today' Show's Sheinelle Jones, Dies at 45 After Battle with Brain Cancer","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-05-23T14:12:16Z","summary":"Uche Ojeh, the beloved husband of \"Today\" show co-host Sheinelle Jones, has passed away at the age of 45 after a courageous fight against glioblastoma, an aggressive form of brain cancer. His death was announced on the show, prompting an outpouring of support for Jones and remembrance of Ojeh as a devoted husband and father.","tags":["Uche Ojeh","Sheinelle Jones","Today Show","Brain Cancer","Glioblastoma","Obituary","Celebrity News","Health"]}},"__N_SSG":true}