{"pageProps":{"postData":{"id":"20250625201853-historic-ceasefire-trump-announces-end-to-12-day-i","contentHtml":"<h1>Historic Ceasefire: Trump Announces End to 12-Day Israel-Iran Conflict</h1>\n<p>In a significant development, former President Donald Trump announced on Monday that Israel and Iran have agreed to a \"Complete and Total CEASEFIRE,\" signaling an end to what he described as a \"12 Day War.\" The announcement was initially made through a post on Truth Social.</p>\n<p>The agreement was intended to be implemented in phases over 24 hours. While some initial reports noted early violations of the ceasefire, President Trump later stated that the agreement was \"in effect\" after reportedly speaking with Israel's leader.</p>\n<p>Adding a touch of characteristic Trump rhetoric, he also publicly rebuked both countries with strong language, while simultaneously praising them for having the \"stamina, courage and intelligence\" to resolve the conflict.</p>\n<p>The announcement has sparked discussions globally, with initial social media sentiment appearing mostly positive, albeit with some debate surrounding the details and the durability of the ceasefire.</p>\n","title":"Historic Ceasefire: Trump Announces End to 12-Day Israel-Iran Conflict","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-06-25T20:18:53Z","summary":"Former President Trump announced a ceasefire agreement between Israel and Iran, aiming to end the recent 12-day conflict. The announcement, made via Truth Social, was met with reports of early violations before Trump confirmed the ceasefire was 'in effect.'","tags":["Israel","Iran","Ceasefire","Donald Trump","Middle East Conflict","Diplomacy"],"sources":[{"url":"https://www.msn.com/en-us/news/world/trump-announces-israel-and-iran-have-agreed-to-a-ceasefire/ar-AA1Hhr0a","title":"MSN"},{"url":"https://www.msn.com/en-us/politics/government/trump-says-iran-israel-ceasefire-in-effect-after-early-violations/ar-AA1Hj5C2","title":"Trump says Iran-Israel ceasefire in effect after early violations"},{"url":"https://www.msn.com/en-us/politics/government/trump-announces-historic-iran-israel-ceasefire-agreement-to-end-12-day-war/ar-AA1HhwQj","title":"Trump announces historic Iran and Israel ceasefire agreement to end '12 Day War'"},{"url":"https://www.msn.com/en-us/news/world/trump-announces-israel-and-iran-have-agreed-to-cease-fire/ar-AA1HhtQV","title":"Trump announces Israel and Iran have agreed to cease-fire"},{"url":"https://www.msn.com/en-us/news/world/trump-publicly-rebukes-israel-and-iran-in-furious-message/ar-AA1HjIYO","title":"Shaky Israel-Iran Cease-Fire Appears to Hold After Trump Publicly Rebukes Both Countries"},{"url":"https://www.msn.com/en-us/politics/international-relations/trump-announces-complete-and-total-ceasefire-between-israel-and-iran/ar-AA1Hht6i","title":"Trump announces 'complete and total' ceasefire between Israel and Iran"}]}},"__N_SSG":true}