{"pageProps":{"postData":{"id":"california-to-sue-trump-administration-over-nation","contentHtml":"<p>California officials are taking legal action against the Trump administration following the controversial federalization of the state's National Guard during recent immigration protests in Los Angeles. Attorney General Rob Bonta and Governor Gavin Newsom have announced their intention to file a federal lawsuit, describing the deployment as \"unnecessary, counterproductive and most importantly unlawful.\"</p>\n<p>The state argues that President Trump's order constituted an abuse of federal authority and \"trampled over\" the state Governor's power. The National Guard troops were deployed amidst anti-ICE protests in the city, sparking debate over the appropriate use of federal military assets in response to civil unrest and immigration enforcement actions.</p>\n<p>The decision to sue has reportedly garnered a mostly positive reaction in simulated social sentiment, though the issue remains a point of debate.</p>\n<p>This legal challenge highlights the ongoing tensions between the state of California and the federal government on matters of immigration and the balance of power in deploying military forces domestically.</p>\n","title":"California to Sue Trump Administration Over National Guard Deployment in Los Angeles","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-06-09T20:19:24Z","summary":"California is set to file a federal lawsuit against the Trump administration, challenging the federalization of the state's National Guard during recent immigration protests in Los Angeles. Officials argue the move was unlawful and an overreach of federal power.","tags":["California","Trump Administration","National Guard","Lawsuit","Immigration Protests","Los Angeles","Federal Authority","State's Rights"],"sources":[{"url":"https://www.msn.com/en-us/news/us/gov-newsom-sues-over-trumps-national-guard-deployment-in-los-angeles-live-updates/ar-AA1Gmor1","title":"Gov. Newsom sues over Trump's National Guard deployment in Los Angeles. Live updates"},{"url":"https://www.msn.com/en-us/news/us/gov-newsom-sues-over-trumps-national-guard-deployment-in-los-angeles-live-updates/ar-AA1Gmor1","title":"Gov. Newsom sues over Trump's National Guard deployment in Los Angeles. Live updates"},{"url":"https://www.mercurynews.com/2025/06/09/california-to-sue-trump-administration-for-using-national-guard-in-immigration-enforcement-riots/","title":"California to sue Trump administration for using National Guard in immigration enforcement riots"},{"url":"https://www.cbc.ca/news/world/california-sues-trump-1.7556324","title":"California to sue Trump administration for deploying National Guard in Los Angeles"},{"url":"https://www.msn.com/en-us/news/us/california-will-sue-trump-over-unlawful-unprecedented-national-guard-deployment/ar-AA1GnR6b","title":"California will sue Trump over 'unlawful, unprecedented' National Guard deployment"},{"url":"https://www.msn.com/en-us/news/world/california-to-sue-trump-hegseth-over-national-guard-deployment-amid-anti-ice-riots/ar-AA1GnPra","title":"California to sue Trump, Hegseth over National Guard deployment amid anti-ICE riots"}]}},"__N_SSG":true}