{"pageProps":{"postData":{"id":"new-trump-portrait-finds-home-in-colorado-capitol-","contentHtml":"<p>A new portrait of President Donald Trump, donated by the White House, now hangs in the Colorado State Capitol. This comes after President Donald Trump expressed dissatisfaction with a previous painting of himself displayed in the same location, deeming it \"distorted.\"</p>\n<p>The newly installed portrait, created by Arizona artist Vanessa Horabuena, has reportedly received President Trump's approval. He has publicly thanked both Colorado and the artist for the new depiction.</p>\n<p>The replacement of the portrait follows President Trump's earlier complaints about the previous painting, which had been commissioned in 2018 (before Governor Jared Polis took office, despite Trump's later accusations of distortion by Polis). This highlights the attention given to official presidential portrayals.</p>\n<p>Public reaction to the new portrait, as reflected in social media sentiment, appears to be mixed, with reports indicating a \"mostly positive\" sentiment alongside \"some debate\" surrounding its placement and the circumstances leading to the change.</p>\n","title":"New Trump Portrait Finds Home in Colorado Capitol After Previous Version Drew Fire","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-07-02T01:17:00Z","summary":"A new, White House-donated portrait of President Donald Trump has been installed in the Colorado State Capitol, replacing an earlier version that the president had criticized.","tags":["Politics","Donald Trump","Colorado","Art","Colorado Capitol","Presidential Portrait"],"sources":[{"url":"https://www.msn.com/en-us/news/politics/new-trump-portrait-donated-by-white-house-hangs-in-colorado-capitol-after-earlier-one-drew-his-ire/ar-AA1HMQAJ","title":"New Trump portrait donated by White House hangs in Colorado Capitol after earlier one drew his ire"},{"url":"https://www.msn.com/en-us/news/politics/trump-thanks-colorado-for-new-portrait-after-trashing-previous-painting/ar-AA1HMOHf","title":"Trump thanks Colorado for new portrait after trashing previous painting"},{"url":"https://www.msn.com/en-us/news/politics/capitol-portrait-trump-claimed-was-distorted-in-whining-rant-replaced-by-new-mugshot-painting/ar-AA1HMWrm","title":"Capitol portrait Trump claimed was 'distorted' in whining rant replaced by new mugshot painting"},{"url":"https://www.denverpost.com/2025/06/26/donald-trump-new-portrait-colorado-capitol-donated/","title":"New Trump portrait set for unveiling at Colorado Capitol after president complained about old one"},{"url":"https://www.wabi.tv/2025/06/30/trump-portrait-he-claimed-was-distorted-is-replaced-with-new-one-state-capitol/","title":"Trump portrait he claimed was 'distorted' is replaced with new one in state capitol"}]}},"__N_SSG":true}