{"pageProps":{"postData":{"id":"perplexity-engineers-slash-development-time-with-a","contentHtml":"<p>The race for AI dominance isn't just about building bigger models; it's also about how effectively companies leverage existing AI tools to boost their own operations. A compelling example comes from AI search engine company Perplexity, where engineers have reportedly slashed development time from days to mere hours by making the use of two specific AI coding tools mandatory.</p>\n<p>This dramatic increase in velocity underscores the potential of AI to revolutionize software development workflows. Perplexity's founder highlighted this shift, noting the speed at which engineers can now prototype and iterate.</p>\n<p>This isn't an isolated trend. AI coding tools are becoming increasingly popular across the tech industry. Surveys indicate a large percentage of engineering teams are already incorporating AI into their work, with tools like GitHub Copilot and Google's Gemini Code Assist leading the pack. Many teams are even experimenting with multiple tools to find the best fit for their needs. Reports suggest that a significant majority of engineers using these tools experience a measurable boost in productivity.</p>\n<p>However, the impact of AI coding tools isn't uniformly positive for everyone. While Perplexity sees massive gains, one study indicated that experienced software engineers using AI code editors actually saw a <em>decrease</em> in productivity. This apparent contradiction raises interesting questions. Does the effectiveness depend on the specific tools used? The complexity of the task? The engineer's existing skill level and workflow? Perhaps experienced developers need to adapt their methods to best leverage AI, or maybe the tools are currently better suited for scaffolding, boilerplate, or tasks where speed outweighs the need for highly nuanced code.</p>\n<p>Interestingly, Perplexity itself functions as a powerful AI tool for coding and debugging, combining real-time data with advanced models to offer relevant solutions. This internal expertise likely informs their effective adoption of other AI development aids.</p>\n<p>The general sentiment surrounding AI coding tools appears largely positive, driven by stories of efficiency gains like Perplexity's, though the debate about their broader impact on developer productivity continues in online discussions.</p>\n<p>Ultimately, Perplexity's experience serves as a powerful case study for the transformative potential of AI in accelerating technical work. It suggests that while challenges and nuances exist, strategic and mandated adoption of the right AI tools can yield significant productivity improvements, pushing the boundaries of what small, agile engineering teams can achieve. The key moving forward will be understanding how to best integrate these tools across different contexts and skill levels to unlock their full potential without hindering quality or workflow.</p>\n","title":"Perplexity Engineers Slash Development Time with AI Coding Tools","authors":[{"username":"@alanaturner","name":"Alana Turner"}],"date":"2025-07-14T08:33:38Z","summary":"Perplexity engineers are seeing dramatic productivity gains, cutting development time from days to hours, by making AI coding tools mandatory. This highlights the transformative potential of AI in software development, though questions remain about its universal impact on productivity.","tags":["AI","Artificial Intelligence","AI Tools","Coding","Software Development","Productivity","Technology","Perplexity","Engineering","Future of Work"],"sources":[{"url":"https://www.msn.com/en-us/news/technology/perplexitys-engineers-use-2-ai-coding-tools-and-theyve-cut-development-time-from-days-to-hours/ar-AA1IxWTf","title":"Perplexity's engineers use 2 AI coding tools, and they've cut development time from days to hours"},{"url":"https://www.msn.com/en-us/technology/artificial-intelligence/ai-coding-tools-made-some-experienced-software-engineers-less-productive-in-a-recent-study/ar-AA1IqSam","title":"AI coding tools made some experienced software engineers less productive in a recent study"},{"url":"https://www.businessinsider.com/ai-coding-tools-popular-github-gemini-code-assist-cursor-q-2025-7","title":"These are the most popular AI coding tools among engineers"},{"url":"https://www.zdnet.com/article/i-put-the-free-version-of-perplexity-ai-through-my-coding-tests-heres-what-happened/","title":"I put the free version of Perplexity.ai through my coding tests - here's what happened"}]}},"__N_SSG":true}