{"pageProps":{"postData":{"id":"rhode-island-passes-bill-banning-assault-weapon-sa","contentHtml":"<p>In a significant legislative move, Rhode Island lawmakers have approved a bill that prohibits the sale and manufacture of specific semi-automatic firearms often referred to as \"assault weapons.\" The bill successfully passed through the state's Democratic-controlled House and Senate, marking a key moment in the state's gun control efforts.</p>\n<p>The final version of the legislation, which saw amendments in the Senate, primarily focuses on preventing future sales and production within the state. While the initial House version had included provisions to ban the possession and use of these firearms, reports indicate that attempts to reintroduce this broader language in the Senate were unsuccessful. As a result, the enacted bill targets the supply side by banning sales and manufacturing, rather than requiring existing owners to surrender their firearms.</p>\n<p>The passage of this bill reflects a push for stricter gun laws in the state. Public reaction to the news appears to be largely positive, according to initial sentiment analysis, though the topic remains one of debate.</p>\n","title":"Rhode Island Passes Bill Banning Assault Weapon Sales","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-06-21T04:20:15Z","summary":"Rhode Island lawmakers have passed legislation banning the sale and manufacture of certain semi-automatic firearms, a move met with largely positive sentiment amidst ongoing national debate on gun control.","tags":["Rhode Island","Assault Weapons Ban","Gun Control","Legislation","Politics"],"sources":[{"url":"https://www.msn.com/en-us/news/us/rhode-island-lawmakers-pass-bill-to-ban-sales-of-assault-weapons/ar-AA1H87Yf","title":"Untitled"},{"url":"https://www.msn.com/en-us/politics/government/rhode-island-lawmakers-pass-bill-to-ban-sales-of-assault-weapons/ar-AA1H83RG","title":"Untitled"},{"url":"https://www.usatoday.com/story/news/politics/2025/06/20/controversial-ri-assault-weapons-bill-makes-its-last-stand/84286207007/","title":"Untitled"},{"url":"https://www.msn.com/en-us/news/politics/rhode-island-lawmakers-approve-modified-assault-style-weapons-ban-bill/ar-AA1H62Jd","title":"Untitled"},{"url":"https://www.djournal.com/news/nation-world/rhode-island-lawmakers-pass-bill-to-ban-sales-of-certain-semiautomatic-rifles-commonly-referred-to/article_42e4bbe9-56b1-514b-8b2c-c4077a2889b6.html","title":"Untitled"},{"url":"https://www.abc6.com/rhode-island-general-assembly-passes-assault-weapons-ban/","title":"Untitled"}]}},"__N_SSG":true}