{"pageProps":{"postData":{"id":"sean-diddy-combs-found-guilty-on-transportation-ch","contentHtml":"<p>A jury has reached a verdict in the federal trial of music mogul Sean \"Diddy\" Combs. Combs was found guilty on two counts of transportation to engage in prostitution.</p>\n<p>Crucially, the jury acquitted him of the more severe charges he faced, including sex trafficking and racketeering conspiracy.</p>\n<p>The conviction on the transportation charges is related to the testimony provided by his ex-partners, Casandra \"Cassie\" Ventura and \"Jane,\" both of whom testified during the trial.</p>\n<p>The trial garnered significant attention, and social media reaction to the verdict is reportedly mixed, leaning towards mostly positive sentiment with some ongoing debate.</p>\n","title":"Sean 'Diddy' Combs Found Guilty on Transportation Charges, Acquitted of Sex Trafficking","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-07-02T16:20:33Z","summary":"Music mogul Sean \"Diddy\" Combs has been found guilty on two counts of transportation to engage in prostitution, while being acquitted of the more serious charges of sex trafficking and racketeering conspiracy.","tags":["Sean Diddy Combs","Verdict","Trial","Sex Trafficking","Prostitution","Crime","Cassie Ventura","Racketeering"],"sources":[{"url":"https://www.msn.com/en-us/news/crime/sean-diddy-combs-found-guilty-on-prostitution-charges/ar-AA1HPN3E","title":"Sean \"Diddy\" Combs found guilty on prostitution charges"},{"url":"https://www.msn.com/en-us/news/crime/sean-diddy-combs-acquitted-of-sex-trafficking-convicted-on-lesser-charges/ar-AA1HPY2b","title":"Sean \"Diddy\" Combs acquitted of sex trafficking, convicted on lesser charges"},{"url":"https://www.msn.com/en-us/news/other/sean-combs-acquitted-of-sex-trafficking-and-racketeering/ar-AA1HQj2H","title":"Sean 'Diddy' Combs Acquitted of Sex Trafficking and Racketeering Conspiracy, but Found Guilty on Lesser Charges"},{"url":"https://www.msn.com/en-us/news/crime/sean-diddy-combs-found-guilty-of-2-out-of-5-charges-in-sex-trafficking-trial/ar-AA1HPWNx","title":"Sean 'Diddy' Combs Guilty Of 2 Counts, Acquitted Of Most Serious Charges In Sex Trafficking Trial"},{"url":"https://www.msn.com/en-us/crime/general/sean-diddy-combs-found-guilty-on-2-of-5-counts/ar-AA1HQ3wV","title":"Sean 'Diddy' Combs Found Guilty of Transportation for Prostitution"},{"url":"https://www.yahoo.com/news/live/sean-diddy-combs-trial-live-updates-jury-reaches-verdict-on-all-5-counts-after-hours-of-deliberations-122503901.html","title":"Sean 'Diddy' Combs trial live updates: Hip-hop mogul found guilty of prostitution offense, acquitted of sex trafficking and racketeering"}]}},"__N_SSG":true}