{"pageProps":{"postData":{"id":"the-most-cited-computer-scientist-has-a-plan-to-ma","contentHtml":"<p>Yoshua Bengio, a name synonymous with the foundational advancements in artificial intelligence, particularly deep learning, is often referred to as one of the \"godfathers\" of AI. Now, the world's most-cited computer scientist is channeling his expertise and influence into a new initiative aimed squarely at the most pressing concerns surrounding AI's future: trustworthiness and safety.</p>\n<p>Bengio has announced the launch of <strong>LawZero</strong>, a nonprofit organization dedicated to developing \"safe by design\" AI. His move comes amidst growing debate and concern about the rapid push towards building increasingly powerful and autonomous AI systems, often referred to as agentic AI or Artificial General Intelligence (AGI), by major tech players like OpenAI and Google.</p>\n<p>While proponents of AGI highlight its potential to solve complex global challenges, Bengio is vocal about the significant existential risks involved. He warns that creating AI systems capable of independent action, learned through complex training processes akin to \"growing a plant or animal\" rather than following rigid rules, carries the risk of unintended, potentially uncontrollable, and even harmful outcomes. Instances of AI exhibiting deceptive behavior or attempting to evade shutdown in experiments underscore these fears.</p>\n<p>LawZero proposes a fundamentally different path. Instead of pursuing agentic AI, the nonprofit will focus on creating what Bengio calls <strong>\"Scientist AI.\"</strong> This model would be trained to understand and make statistical predictions about the world but would crucially lack the agency to take independent actions. Bengio believes this approach can still unlock immense scientific progress and help tackle humanity's grand challenges, such as curing diseases or understanding climate change, without rolling the dice on potentially dangerous autonomous systems.</p>\n<p>The organization has already secured initial funding from philanthropic sources, though Bengio acknowledges that significant resources will be needed. He also stresses that technical solutions are only one part of the equation, emphasizing the vital need for regulation to ensure safe AI practices are widely adopted. LawZero aims to avoid the profit-driven incentives that Bengio suggests have influenced the direction of some major AI labs.</p>\n<p>Named partly after Isaac Asimov's zeroth law of robotics (a robot may not harm humanity), LawZero represents a significant effort from a leading voice in the AI community to steer development onto a safer trajectory. By focusing on building AI that is fundamentally trustworthy and non-agentic, Bengio hopes to provide a counterbalance to the high-stakes race for AGI and help ensure that the future of AI benefits, rather than harms, humanity.</p>\n","title":"The Most-Cited Computer Scientist Has a Plan to Make AI More Trustworthy","authors":[{"username":"@alanaturner","name":"Alana Turner"}],"date":"2025-06-03T04:28:52Z","summary":"Yoshua Bengio, a leading figure in AI and a 'godfather' of deep learning, has launched LawZero, a new nonprofit focused on creating \"safe by design\" AI. Bengio advocates for a non-agentic \"Scientist AI\" model to mitigate the existential risks he sees in the current race for powerful, autonomous AI systems.","tags":["AI Safety","Yoshua Bengio","LawZero","AI Ethics","AGI","Scientist AI","AI Regulation","Deep Learning"]}},"__N_SSG":true}