{"pageProps":{"postData":{"id":"tragedy-strikes-chicago-rappers-album-party-four-d","contentHtml":"<p>Chicago, IL – A festive atmosphere outside an album release party for rapper Mello Buckzz in downtown Chicago's River North neighborhood was shattered by violence late Wednesday night. A drive-by shooting tragically resulted in the deaths of four individuals and injuries to fourteen others.</p>\n<p>The incident occurred as attendees were leaving the event held at Artis Restaurant and Lounge. Police reported that a vehicle approached the location, and at least one gunman opened fire on the crowd standing outside. The rapid gunfire caused chaos and panic among the partygoers.</p>\n<p>Among the victims was Taylor Walker, 26, whose mother expressed her profound grief, stating there was a \"hole in her heart.\" Tragically, rapper Mello Buckzz also shared on social media that her partner and best friend were among those killed, writing, \"I dont wish this typa pain on nobody.\"</p>\n<p>Authorities are currently investigating the motive behind the shooting. A law enforcement source indicated that the rapper may have been the intended target, though she had reportedly left the venue before the attack.</p>\n<p>The senseless act of violence has sent shockwaves through the community and highlighted the ongoing challenges with gun violence in the city. The venue, which reportedly operated from the same address as a nightclub previously shut down due to a fatal mass shooting in 2022, has been issued a summary closure by the city as the investigation continues.</p>\n","title":"Tragedy Strikes Chicago Rapper's Album Party: Four Dead, Fourteen Injured in Mass Shooting","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-07-04T08:22:54Z","summary":"A night of celebration turned into a scene of horror in Chicago's River North neighborhood after a drive-by shooting outside rapper Mello Buckzz's album release party left four people dead and fourteen wounded.","tags":["Chicago","Mass Shooting","Gun Violence","Crime","Mello Buckzz","River North"],"sources":[{"url":"https://www.msn.com/en-us/news/crime/hole-in-my-heart-mother-mourns-daughter-lost-in-chicago-mass-shooting-at-rapper-album-party/ar-AA1HWmjX","title":"'Hole in my heart': Mother mourns daughter lost in Chicago mass shooting at rapper album party"},{"url":"https://chicago.suntimes.com/live/2025/07/03/river-north-shooting-chicago-artis-bar","title":"River North mass shooting sees 4 killed, 14 wounded after rapper's party"},{"url":"https://www.rollingstone.com/music/music-news/chicago-shooting-mello-buckzz-event-1235378463/","title":"Four Dead and 14 Injured in Drive-By Shooting at Chicago Rapper Mello Buckzz Album Release Party"},{"url":"https://www.msn.com/en-us/news/crime/3-killed-16-wounded-in-mass-shooting-outside-downtown-chicago-nightclub-artis-lounge/ar-AA1HSxUc","title":"3 killed, 16 wounded in mass shooting outside downtown Chicago nightclub Artis Lounge"},{"url":"https://www.msn.com/en-us/news/crime/18-shot-in-a-matter-of-seconds-in-deadly-mass-shooting-police/ar-AA1HTvee","title":"4 killed, 14 hurt in Chicago mass shooting: 'Absolute chaos'"}]}},"__N_SSG":true}