{"pageProps":{"postData":{"id":"trump-targets-npr-pbs-and-global-aid-in-9-billion-","contentHtml":"<p>President Donald Trump is pushing Congress to repeal over $9 billion in federal funds that lawmakers had already approved, setting his sights on public broadcasting, foreign aid, and global health programs.</p>\n<p>The formal request, sent to Capitol Hill, seeks to claw back approximately $9 billion (or $9.4 billion depending on the report) from various initiatives. Among the targets are funds allocated to NPR and PBS, crucial institutions for public media in the United States. The proposal also includes significant cuts to foreign aid and global health efforts, such as funding for combating HIV/AIDS and contributions to the World Health Organization (WHO).</p>\n<p>The White House framed the request as an action stemming from recommendations made by Elon Musk's Department of Government Efficiency, a body tasked with identifying potential cost savings. The targeted programs were broadly characterized by the administration as \"wasteful\" and \"woke,\" signaling a focus on reducing spending in areas often criticized by conservatives.</p>\n<p>This move represents a direct challenge to congressional spending decisions and highlights the administration's priorities for federal dollars. Rescinding previously approved funds is a legislative maneuver that requires congressional approval.</p>\n<p>The proposed cuts could have wide-ranging impacts, from altering the landscape of public media and its reach to affecting critical international development and health initiatives supported by the U.S.</p>\n<p>Initial social sentiment surrounding the request appears to be \"Mostly positive, some debate,\" suggesting a mixed but generally favorable reaction from some segments of the public, alongside significant discussion and disagreement.</p>\n","title":"Trump Targets NPR, PBS, and Global Aid in $9 Billion Repeal Effort","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-06-04T08:22:43Z","summary":"President Trump has formally asked Congress to rescind over $9 billion in previously approved federal funding, targeting public broadcasting, foreign aid, and global health initiatives, citing them as 'wasteful' and 'woke' based on recommendations from his Department of Government Efficiency.","tags":["Politics","Trump Administration","Budget Cuts","Government Spending","NPR","PBS","Foreign Aid","Global Health","Congress"]}},"__N_SSG":true}