{"pageProps":{"postData":{"id":"trump-gets-his-military-parade-a-spectacle-for-the","contentHtml":"<p>A long-held wish of former President Donald Trump for a large-scale military parade in the nation's capital has come to fruition. Today, Washington, D.C. hosts a significant military procession marking the U.S. Army's 250th Anniversary, an event closely tied to Trump's persistent interest in showcasing American military might in a public spectacle.</p>\n<p>The parade coincides with President Trump's 79th birthday and is expected to draw up to 200,000 attendees. Over 6,500 soldiers are participating, with a display of impressive military assets including M1 Abrams tanks, Bradley Infantry Fighting Vehicles, Paladin howitzers, and a variety of helicopters like Apache, Black Hawk, and Chinook models.</p>\n<p>While officially a celebration of the Army's milestone, the event fulfills Trump's publicly stated desire for a parade, an idea he has championed since his first term, reportedly inspired by Bastille Day celebrations in France. News reports indicate the event is expected to cost between $30 million and $45 million.</p>\n<p>President Trump is scheduled to deliver remarks during the event. The spectacle, framed by some as a tribute to the armed forces and by others as a political display, is available for viewing across various news platforms and online streams, including via The Tennessean's YouTube channel.</p>\n<p>The social sentiment surrounding the parade appears to be largely positive, though some debate exists regarding its purpose, timing, and cost.</p>\n","title":"Trump Gets His Military Parade: A Spectacle for the Army's 250th Anniversary","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-06-14T12:29:29Z","summary":"Years after first expressing his desire for a grand military procession, former President Donald Trump sees his wish fulfilled with a large-scale parade in Washington, D.C., coinciding with the U.S. Army's 250th birthday and his own. The event features thousands of troops and military hardware, drawing significant attention and debate.","tags":["Trump","Military Parade","Washington DC","US Army","Politics","National Events"],"sources":[{"url":"https://www.msn.com/en-us/news/politics/this-would-make-great-tv-how-donald-trump-got-the-military-parade-he-wanted/ar-AA1GHwJb","title":"'This would make great TV': How Donald Trump got the military parade he wanted"},{"url":"https://www.msn.com/en-us/news/other/trump-military-parade-to-mark-army-s-birthday-in-d-c.-today/ar-AA1GHvuO","title":"Trump military parade to mark Army's birthday in d.c. today"},{"url":"https://www.usatoday.com/story/news/2025/06/14/where-can-i-stream-watch-live-trump-military-parade-june-14-2025/84185104007/","title":"Where to watch Trump's military parade live? Here's what's happening in Washington, D.C."},{"url":"https://www.msn.com/en-us/news/us/what-time-is-the-trump-parade-why-is-he-having-a-military-parade-location-route-tickets/ar-AA1GHtti","title":"What time is the Trump parade? Why is he having a military parade? Location, route, tickets"},{"url":"https://www.msn.com/en-us/news/politics/tanks-helicopters-and-a-military-parade-how-donald-trump-is-spending-his-79th-birthday/ar-AA1GHdeh","title":"Tanks, helicopters and a military parade: How Donald Trump is spending his 79th birthday"}]}},"__N_SSG":true}