{"pageProps":{"postData":{"id":"trump-reports-hundreds-of-millions-of-dollars-from","contentHtml":"<p>Former President Donald Trump's latest financial disclosure report has offered a detailed look into his extensive business holdings and income sources. The filing reportedly shows that Trump earned hundreds of millions of dollars from a variety of ventures, highlighting the diverse nature of his post-presidency financial activities.</p>\n<p>Key among the reported income streams are earnings from his golf clubs, licensing deals, and notably, cryptocurrency ventures, including memecoins. Some reports indicate that the total income from these sources alone exceeded $600 million.</p>\n<p>Beyond these major categories, the disclosure also listed income from merchandise sales and speaking engagements, further illustrating the breadth of his business interests.</p>\n<p>The public disclosure provides a glimpse into the financial landscape of the billionaire former president, sparking discussion and analysis across various media outlets and online platforms. Initial reactions on social media appear to be largely positive, though the figures and sources of income are also subject to ongoing debate.</p>\n","title":"Trump reports hundreds of millions of dollars from crypto, golf, licensing fees","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-06-14T04:21:02Z","summary":"A recent financial disclosure from former President Donald Trump reveals significant income streams from diverse ventures, including cryptocurrency, golf clubs, and licensing deals, reportedly totaling over $600 million.","tags":["Donald Trump","Financial Disclosure","Crypto","Cryptocurrency","Golf","Licensing Fees","Politics","Business"],"sources":[{"url":"https://www.msn.com/en-us/news/politics/trump-reports-hundreds-of-millions-of-dollars-from-crypto-golf-licensing-fees/ar-AA1GGsFV","title":"MSN"},{"url":"https://www.msn.com/en-gb/news/world/trump-reports-more-than-600-million-in-income-from-crypto-golf-licensing-fees/ar-AA1GGQEf","title":"MSN"},{"url":"https://www.msn.com/en-in/news/world/trump-reports-tens-of-millions-in-income-from-crypto-ventures/ar-AA1GGBND","title":"MSN"},{"url":"https://www.rnz.co.nz/news/world/564139/how-trump-makes-his-money-revealed-including-memecoins-golf-and-licensing-fees","title":"How Trump makes his money revealed - including memecoins, golf and licensing fees"},{"url":"https://www.msn.com/en-us/money/markets/trump-raked-in-57m-income-from-family-crypto-firm-seven-figures-from-guitars-sneakers-watches-and-books-financial-disclosure/ar-AA1GGjZn","title":"MSN"}]}},"__N_SSG":true}