{"pageProps":{"postData":{"id":"were-all-going-to-die-gop-faces-backlash-over-medi","contentHtml":"<p>Amidst heated debate surrounding a proposed Republican budget bill that includes significant cuts to anti-poverty programs, including Medicaid, a comment from Senator Joni Ernst of Iowa has drawn widespread condemnation and disbelief.</p>\n<p>During a recent town hall event, Senator Ernst was pressed by an attendee about the potential consequences of these cuts, specifically the fear that they could lead to deaths among those relying on the program for essential healthcare. Her response, reportedly met with groans and shouts from the audience, was stark: \"Well, we all are going to die.\"</p>\n<p>The remark quickly circulated, drawing sharp criticism from healthcare advocates, political opponents, and concerned citizens who argued it trivialized the potentially life-threatening impact of reducing access to healthcare for low-income and vulnerable individuals.</p>\n<p>Adding fuel to the fire, news reports indicate that Senator Ernst later doubled down on her comment in a social media video, seemingly joking about the outrage and suggesting critics should \"embrace my Lord and savior.\" This follow-up only intensified the backlash, with many viewing it as dismissive and insensitive.</p>\n<p>The proposed GOP bill aims to reduce federal spending, and proponents argue that cuts to programs like Medicaid are necessary. The White House has stated that their Medicaid policy is intended to remove individuals who are not truly eligible for coverage, asserting it won't harm those who deserve assistance.</p>\n<p>However, critics counter that programs like Medicaid save tens of thousands of lives yearly by providing access to vital medical care, and that cuts could have devastating real-world consequences for families and individuals who cannot afford private insurance. Senator Ernst's controversial defense has brought this critical aspect of the budget debate into sharp focus, highlighting the human cost that opponents argue is at stake.</p>\n","title":"'We're All Going to Die': GOP Faces Backlash Over Medicaid Cut Defense","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-06-03T01:16:29Z","summary":"Senator Joni Ernst's controversial remark regarding potential Medicaid cuts, suggesting 'We all are going to die,' ignites a firestorm of criticism and highlights the heated debate over the impact of proposed budget reductions on vulnerable populations.","tags":["Politics","Medicaid","Healthcare","US Senate","Joni Ernst","GOP","Budget Cuts"]}},"__N_SSG":true}