{"pageProps":{"postData":{"id":"tragedy-in-dhaka-air-force-jet-crashes-into-colleg","contentHtml":"<p>A devastating crash occurred in Dhaka, the capital of Bangladesh, on Monday afternoon when a Bangladesh Air Force training aircraft went down, tragically impacting the campus of Milestone School and College.</p>\n<p>The aircraft, identified as a Chinese-made F-7 BGI jet, crashed in the northern suburb of Uttara shortly after takeoff. It immediately burst into flames, creating a scene of horror and chaos as students were attending classes.</p>\n<p>Initial reports from the scene confirm a significant loss of life. While casualty numbers are still being finalized, officials have reported at least 19 people killed, a figure that includes the plane's pilot. The number of injured is believed to be over 100, with some reports citing as many as 164 individuals hurt. A large portion of the victims, both injured and deceased, are reported to be students who were on the campus at the time of the crash.</p>\n<p>Emergency services and rescuers responded quickly, transporting the injured to local hospitals using any means available. The incident is being described as the deadliest aviation disaster in Dhaka's recent memory.</p>\n<p>The cause of the crash is currently unknown, and an investigation is underway to determine the circumstances that led to this tragic event.</p>\n","title":"Tragedy in Dhaka: Air Force Jet Crashes Into College Campus, Killing at Least 19","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-07-21T12:37:38Z","summary":"A Bangladesh Air Force training jet crashed into a bustling college and school campus in Dhaka, the nation's capital, on Monday. The tragic incident has resulted in at least 19 fatalities, including the pilot, and has left over 100 people injured, many of them students.","tags":["Bangladesh","plane crash","Dhaka","world news","aviation disaster"],"sources":[{"url":"https://www.msn.com/en-us/news/world/at-least-19-killed-as-bangladesh-air-force-plane-crashes-into-college-campus/ar-AA1IZudj","title":"At least 19 killed as Bangladesh air force plane crashes into college campus"},{"url":"https://www.bostonglobe.com/2025/07/21/world/bangladesh-air-force-jet-crash/","title":"A Bangladesh Air Force jet crashes into a Dhaka school and kills 18"},{"url":"https://www.msn.com/en-xl/news/other/at-least-16-dead-after-military-plane-crashes-into-dhaka-school/ar-AA1IZnlG","title":"At least 16 dead after air force jet crashes into Bangladesh school"},{"url":"https://www.msn.com/en-us/public-safety-and-emergencies/health-and-safety-alerts/death-toll-rises-to-16-after-a-bangladesh-air-force-jet-crashes-into-dhaka-school/ar-AA1IZzTk","title":"Death toll rises to 16 after a Bangladesh Air Force jet crashes into Dhaka school"},{"url":"https://www.msn.com/en-us/news/world/one-killed-as-bangladesh-air-force-plane-crashes-into-college-campus/ar-AA1IZ4XA","title":"1 killed as Bangladesh air force plane crashes in college campus"}]}},"__N_SSG":true}