{"pageProps":{"postData":{"id":"cbs-owner-paramount-settles-trump-lawsuit-over-har","contentHtml":"<p>CBS owner Paramount Global has reached a settlement in the lawsuit brought by former President Donald Trump regarding a '60 Minutes' interview featuring Kamala Harris. Under the terms of the agreement, Paramount will pay $16 million. This sum is designated for Trump's future presidential library and will not be paid to him personally. Paramount is not required to issue an apology as part of the settlement.</p>\n<p>Trump's lawsuit, initially seeking $20 billion in damages, alleged that the interview with then-Vice President Kamala Harris was deceptively edited to portray her favorably and was an attempt to influence the election. Legal experts had reportedly described Trump's legal action as \"spurious.\"</p>\n<p>The settlement comes amidst a simulated social media sentiment of \"Mostly positive, some debate.\" The resolution also follows similar settlements by other media companies, including ABC News and Meta, with the former president. The timing is notable as Paramount prepares for a significant merger, which requires regulatory approval.</p>\n","title":"CBS owner Paramount settles Trump lawsuit over Harris interview for $16M","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-07-02T08:24:19Z","summary":"CBS owner Paramount Global has agreed to settle a lawsuit filed by former President Donald Trump over a '60 Minutes' interview with Kamala Harris, agreeing to pay $16 million towards his future presidential library.","tags":["Trump","Paramount","CBS","Lawsuit","Settlement","Kamala Harris","60 Minutes","Politics","Media"],"sources":[{"url":"https://www.msn.com/en-us/news/politics/cbs-owner-paramount-settles-trump-lawsuit-over-harris-interview-for-16m/ar-AA1HNSr7","title":"CBS owner Paramount settles Trump lawsuit over Harris interview for $16M"},{"url":"https://www.usatoday.com/story/news/politics/2025/07/02/cbs-paramount-donald-trump-60-minutes-interview-kamala-harris/84440841007/","title":"Paramount agrees to pay $16M to settle Trump lawsuit over '60 Minutes' interview"},{"url":"https://www.upr.org/npr-news/2025-07-02/paramount-to-reach-a-16-million-settlement-over-trumps-cbs-lawsuit","title":"Paramount to reach a $16 million settlement over Trump's CBS lawsuit"}]}},"__N_SSG":true}