{"pageProps":{"postData":{"id":"bryan-kohberger-to-plead-guilty-in-idaho-college-m","contentHtml":"<p>Bryan Kohberger, the suspect in the brutal 2022 murders of four University of Idaho students – Ethan Chapin, Xana Kernodle, Madison Mogen, and Kaylee Goncalves – has reportedly agreed to plead guilty to all counts against him. The decision, which came to light through a letter sent to victims' families, means Kohberger will accept four consecutive life sentences without the possibility of parole, thereby sparing him from the death penalty.</p>\n<p>Kohberger, a former criminology doctoral student at Washington State University, was charged with four counts of first-degree murder and one count of burglary. His trial had been scheduled to begin in August.</p>\n<p>The news of the plea agreement has drawn strong reactions. According to reports, the family of one of the victims expressed fury at the state of Idaho, feeling they were not adequately consulted and that the state \"failed us.\" However, the plea is intended to ensure a conviction and prevent decades of potential appeals that could prolong the legal process for the victim's families.</p>\n<p>Authorities linked Kohberger to the killings through various pieces of evidence, including cellphone data, security camera footage, and DNA found on a knife sheath at the crime scene.</p>\n","title":"Bryan Kohberger to Plead Guilty in Idaho College Murders, Avoids Death Penalty","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-07-01T01:24:32Z","summary":"Bryan Kohberger, the man accused in the 2022 slayings of four University of Idaho students, has reportedly agreed to plead guilty to all charges, accepting life in prison and avoiding the death penalty.","tags":["Crime","Idaho Murders","Bryan Kohberger","Legal","Plea Deal"],"sources":[{"url":"https://www.msn.com/en-us/news/crime/bryan-kohberger-agrees-to-plead-guilty-to-all-counts-in-idaho-college-murders-case/ar-AA1HIo8c","title":"Bryan Kohberger agrees to plead guilty to all counts in Idaho college murders case"},{"url":"https://www.nbcnews.com/news/us-news/bryan-kohberger-plea-deal-idaho-college-murder-rcna216099","title":"Bryan Kohberger apparently agrees to a plea deal in Idaho college student murders, victim's family says"},{"url":"https://www.msn.com/en-us/crime/general/bryan-kohberger-agrees-to-plead-guilty-in-2022-university-of-idaho-murders-avoiding-death-penalty/ar-AA1HIAOX","title":"Bryan Kohberger Agrees To Plead Guilty In 2022 University Of Idaho Murders, Avoiding Death Penalty"},{"url":"https://www.livemint.com/news/us-news/bryan-kohberger-suspect-in-four-idaho-college-students-murder-agrees-to-plead-guilty-know-all-about-him-11751331151917.html","title":"Bryan Kohberger, suspect in four Idaho college students' murder, agrees to plead guilty; Know all about him"},{"url":"https://www.msn.com/en-us/news/crime/bryan-kohberger-accepts-plea-deal-in-idaho-student-murders-case/ar-AA1HItrw","title":"Bryan Kohberger accepts plea deal in Idaho student murders case"}]}},"__N_SSG":true}