{"pageProps":{"postData":{"id":"iran-could-resume-uranium-enrichment-within-months","contentHtml":"<p>The head of the United Nations' nuclear watchdog, Rafael Grossi, has issued a sobering assessment: Iran possesses the technical and industrial capacity to resume enriching uranium in a timeframe of \"a matter of months,\" potentially even sooner. This evaluation comes despite recent US strikes targeting Iranian nuclear facilities.</p>\n<p>Grossi, the Director General of the International Atomic Energy Agency (IAEA), indicated in recent interviews that while the damage inflicted by the strikes was \"severe,\" it was critically \"not total.\" This contradicts earlier assertions by former President Donald Trump, who claimed the strikes had set back Iran's nuclear ambitions by decades.</p>\n<p>The IAEA chief's comments underscore concerns about the true impact of the military actions on Iran's nuclear program and the potential for a swift return to activities that could move the country closer to developing nuclear weapons. He highlighted that Iran has the necessary infrastructure and knowledge to quickly bring centrifuge cascades back online.</p>\n<p>The situation is further complicated by the lack of full IAEA access to Iranian nuclear sites. Iran has reportedly banned Grossi and removed surveillance cameras, hindering the agency's ability to verify the status of facilities and materials, including any enriched uranium stockpiles that may have been moved before the strikes. Grossi emphasized the critical need for the IAEA to regain access to re-establish knowledge of nuclear activities and material.</p>\n<p>While a ceasefire has reportedly been reached between Israel and Iran following the recent escalation, the IAEA's assessment raises significant questions about the long-term effectiveness of the strikes and the ongoing challenges in monitoring Iran's nuclear program. The international community remains focused on finding a diplomatic solution, but the potential for Iran to rapidly resume enrichment adds urgency to these efforts.</p>\n<p>Debate continues regarding the full implications of Grossi's statement and the path forward for international engagement with Iran on its nuclear activities.</p>\n","title":"Iran Could Resume Uranium Enrichment Within Months, Warns UN Watchdog Chief","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-06-29T12:30:41Z","summary":"Despite recent US strikes, the head of the International Atomic Energy Agency (IAEA) states that Iran retains the capacity to restart enriching uranium in a matter of months, contradicting previous claims about the strikes' impact.","tags":["Iran","Uranium Enrichment","IAEA","Nuclear Program","International Relations","Middle East","Politics"],"sources":[{"url":"https://www.msn.com/en-us/news/world/un-nuclear-watchdog-chief-says-iran-could-again-begin-enriching-uranium-in-matter-of-months/ar-AA1HCYbj","title":"UN nuclear watchdog chief says Iran could again begin enriching uranium in 'matter of months'"},{"url":"https://www.politico.eu/article/iran-resume-uranium-enrichment-months-iaea-rafael-mariano-grossi/","title":"Iran could resume uranium enrichment in ‘months,’ says IAEA chief"},{"url":"https://alkhaleejtoday.co/international/5853797/IAEA-Iran-could-resume-uranium-enrichment-within-months-after-US-strikes.html","title":"IAEA: Iran could resume uranium enrichment within months after U.S. strikes"},{"url":"https://www.msn.com/en-gb/news/world/iran-could-resume-uranium-enrichment-in-a-matter-of-months-un-nuclear-watchdog-says/ar-AA1HCzT8","title":"Iran could resume uranium enrichment 'in a matter of months', UN nuclear watchdog says"}]}},"__N_SSG":true}