{"pageProps":{"postData":{"id":"tragedy-on-the-east-river-mexican-navy-sailboat-cr","contentHtml":"<p>Late Saturday night, an unexpected and dramatic incident unfolded on the East River as a Mexican Navy training sailboat, reportedly on a goodwill visit, struck the underside of the iconic Brooklyn Bridge.</p>\n<p>The collision, which occurred around 9 p.m., sent shockwaves through onlookers and those aboard the vessel. Initial reports from officials indicate a significant human toll, with between 19 and 22 people injured and tragically, at least two fatalities reported – all casualties were among those on the ship.</p>\n<p>Witnesses on shore described the scene as \"scary,\" hearing screams as the towering masts of the tall ship made contact with the historic bridge structure.</p>\n<p>Fortunately, early assessments from New York City officials, including Mayor Eric Adams who provided updates on the situation, suggest that the Brooklyn Bridge itself appears to have sustained no structural damage from the impact.</p>\n<p>The cause of the collision is not immediately clear and will likely be the subject of investigation. The incident highlights the inherent challenges and risks involved in navigating large vessels, particularly tall ships, in busy urban waterways with overhead structures.</p>\n<p>The Mexican Navy vessel, identified as a training sailboat, adds a layer of complexity as trainees may have been involved in the navigation. This unfortunate event casts a somber note on what was intended to be a friendly visit to New York City.</p>\n","title":"Tragedy on the East River: Mexican Navy Sailboat Crashes into Brooklyn Bridge","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-05-18T04:58:56Z","summary":"A Mexican Navy training sailboat collided with the underside of the Brooklyn Bridge late Saturday night, resulting in multiple injuries and at least two fatalities among those aboard the vessel.","tags":["Brooklyn Bridge","Mexican Navy","Sailboat","Ship Crash","NYC","Maritime Incident","News"]}},"__N_SSG":true}