{"pageProps":{"postData":{"id":"deerhoof-exits-spotify-over-ceos-investment-in-mil","contentHtml":"<p>Veteran indie rock band Deerhoof has announced they will be removing their entire music catalog from the streaming giant Spotify. The band's decision stems from Spotify CEO Daniel Ek's substantial investment, reportedly close to $700 million, in Helsing—a European technology firm focused on developing artificial intelligence for military use, including defense software and potential applications in drones and weaponry.</p>\n<p>In a firm statement, Deerhoof articulated their moral stance, declaring, \"We don’t want our music killing people.\" They further emphasized their unwillingness to have their \"success being tied to AI battle tech.\" The band also levied broader criticism against Spotify, labeling it a \"data-mining scam masquerading as a ‘music company’\" that is \"flushing itself down the toilet.\"</p>\n<p>This move by Deerhoof highlights the increasingly complex ethical considerations arising at the intersection of technology, investment capital, and the arts. As tech leaders diversify their portfolios into potentially controversial sectors like military AI, artists are faced with challenging decisions about their presence on platforms tied to these investments. Deerhoof's protest, though they acknowledge it's a choice afforded by their touring income, underscores a growing tension between creators and the corporate entities distributing their work, particularly when those entities' activities conflict with the artists' values.</p>\n<p>The band is working to remove their music as quickly as possible, a process they note requires cooperation and financial sacrifice from their various labels. While initial social sentiment appears largely supportive of Deerhoof's position, the action ignites debate about the responsibilities of tech companies, the ethics of AI development for military purposes, and the role artists can play in protesting corporate decisions they deem morally objectionable.</p>\n","title":"Deerhoof Exits Spotify Over CEO's Investment in Military AI","authors":[{"username":"@alanaturner","name":"Alana Turner"}],"date":"2025-06-30T16:29:36Z","summary":"Indie veterans Deerhoof are pulling their music from Spotify, citing CEO Daniel Ek's significant investment in a company developing AI for military applications. The band states, \"We don’t want our music killing people.\"","tags":["AI","Spotify","Music","Deerhoof","Daniel Ek","Military AI","Tech Ethics","Streaming","Protest"],"sources":[{"url":"https://www.msn.com/en-us/music/news/indie-veterans-deerhoof-remove-catalog-from-spotify-over-daniel-eks-investment-in-ai-company-creating-military-tech/ar-AA1HHuvE","title":"Indie Veterans Deerhoof Remove Catalog From Spotify Over Daniel Ek's Investment in AI Company Creating Military Tech"},{"url":"https://www.avclub.com/deerhoof-leaves-spotify-over-ceo-ai-battle-tech","title":"Deerhoof leaves Spotify, cites CEO investment in \"AI battle tech\""},{"url":"https://www.stereogum.com/2313608/deerhoof-leaving-spotify-over-ceos-investment-in-ai-military-startup/news/","title":"Deerhoof Leaving Spotify Over CEO's Investment In AI Military Startup"},{"url":"https://www.thefader.com/2025/06/30/deerhoof-remove-music-spotify","title":"Deerhoof will remove music from Spotify, citing Daniel Ek’s A.I. investments"},{"url":"https://www.brooklynvegan.com/deerhoof-leaving-spotify-after-daniel-ek-ai-battletech-investment-we-dont-want-our-music-killing-people/","title":"Deerhoof leaving Spotify after Daniel Ek AI battletech investment: \"We don't want our music killing people\""}]}},"__N_SSG":true}