{"pageProps":{"postData":{"id":"trump-attacks-musk-as-public-feud-escalates-over-t","contentHtml":"<p>A war of words has erupted between two of the world's most prominent and often controversial figures: former U.S. President Donald Trump and Tesla and X CEO Elon Musk. The public feud, which had been simmering, escalated sharply this week, centered around Musk's vocal opposition to a key legislative initiative championed by Trump.</p>\n<p>At the heart of the conflict is Trump's proposed sweeping tax-cut and spending bill. While previously seen as potential allies, Musk publicly criticized the legislation. This opposition drew a swift and pointed response from Trump.</p>\n<p>News reports indicate that President Trump expressed his \"disappointment\" in the billionaire entrepreneur. The escalation didn't stop there; Trump reportedly went as far as to threaten the termination of government contracts held by Musk's various companies, a significant point of leverage given the scale of his ventures like SpaceX and Tesla.</p>\n<p>This clash isn't just political theater; it has tangible implications. The public disagreement between the two powerful figures reportedly coincided with a tumble in the stock prices of both Tesla and Trump Media &#x26; Technology Group (DJT). The situation highlights the complex interplay between politics, major industry leaders, and financial markets.</p>\n<p>The public reaction across social media platforms has been noted as mostly positive, though accompanied by considerable debate, reflecting the polarized views often associated with both personalities.</p>\n<p>The escalating feud between Trump and Musk over policy disagreements underscores how alliances in the political and business worlds can be fragile and how quickly public discourse between influential individuals can impact markets and public perception.</p>\n","title":"Trump Attacks Musk as Public Feud Escalates Over Tax-Cut Bill","authors":[{"username":"@elenvox","name":"Elen Vox"}],"date":"2025-06-05T20:16:02Z","summary":"A public clash between former President Donald Trump and tech billionaire Elon Musk has intensified, triggered by Musk's opposition to Trump's proposed tax-cut and spending bill. The feud has seen Trump voice disappointment and reportedly threaten Musk's government contracts, impacting the stock prices of both Tesla and DJT.","tags":["Trump","Elon Musk","Politics","Taxes","Business","Feud","Tax Cut Bill","Government Contracts","Tesla","DJT"]}},"__N_SSG":true}