{"pageProps":{"postData":{"id":"cloudflare-launches-marketplace-to-let-websites-ch","contentHtml":"<p>In a significant move aimed at empowering content creators in the age of artificial intelligence, Cloudflare has launched a new marketplace called \"Pay per Crawl.\" This initiative fundamentally changes the default relationship between websites and AI crawlers.</p>\n<p>Traditionally, website owners have largely allowed search engines and other bots to crawl their sites freely in exchange for potential traffic referrals. However, with the rise of generative AI, publishers have grown increasingly concerned that AI companies are scraping vast amounts of their content for model training without adequate compensation or a return of value.</p>\n<p>Cloudflare, a major internet infrastructure provider, is addressing this by making a crucial change: new websites using their service will now <em>default</em> to blocking all AI crawlers. Existing users also have easy-to-use tools to block bots. This puts control back in the hands of the publisher.</p>\n<p>The \"Pay per Crawl\" marketplace, currently in private beta, takes this a step further. It allows website owners to set specific rates that AI companies must pay for accessing their content. This could be a micropayment for every \"crawl.\" Publishers can also choose to allow free access or maintain the default block.</p>\n<p>Several major publishers, including Conde Nast, TIME, The Associated Press, The Atlantic, ADWEEK, and Fortune, are supporting Cloudflare's move towards a permission-based internet.</p>\n<p>Data shared by Cloudflare highlights the publishers' concerns: compared to Google's crawler (which scraped 14 times for every referral in June), OpenAI's crawler scraped 1,700 times per referral, and Anthropic's scraped a staggering 73,000 times per referral. This suggests AI companies benefit immensely from publisher content with minimal direct return.</p>\n<p>This new model offers a potential revenue stream for publishers navigating a changing digital landscape, especially as \"agentic\" AI (AI systems that can perform tasks on behalf of users) may further reduce direct website traffic. Cloudflare will act as the intermediary for transactions, and the CEO has even mentioned exploring the use of stablecoins in the future.</p>\n<p>While the success of \"Pay per Crawl\" depends on adoption by both publishers and AI companies (convincing firms to pay for what they previously got free is a challenge), it represents a bold vision for a more equitable internet economy in the AI era.</p>\n","title":"Cloudflare Launches Marketplace to Let Websites Charge AI Bots for Scraping","authors":[{"username":"@alanaturner","name":"Alana Turner"}],"date":"2025-07-02T01:47:33Z","summary":"Cloudflare is introducing a new system, 'Pay per Crawl,' allowing publishers to control and monetize how AI bots access their content, shifting the dynamic between creators and AI companies.","tags":["AI","Cloudflare","Content Monetization","Web Scraping","Publishing","Artificial Intelligence"],"sources":[{"url":"https://techcrunch.com/2025/07/01/cloudflare-launches-a-marketplace-that-lets-websites-charge-ai-bots-for-scraping/","title":"Cloudflare launches a marketplace that lets websites charge AI bots for scraping"},{"url":"https://www.msn.com/en-us/news/technology/cloudflare-to-block-ai-bots-from-scraping-content-launches-marketplace-to-let-websites-charge-for-crawling/ar-AA1HLex2","title":"MSN"},{"url":"https://www.businessinsider.com/cloudflare-block-ai-crawlers-by-default-payment-for-access-2025-6","title":"Cloudflare to block AI bot crawlers by default and let websites demand payment for access"},{"url":"https://www.msn.com/en-us/technology/artificial-intelligence/web-giant-cloudflare-bans-ai-bots-from-scraping-content-by-default/ar-AA1HLpWo","title":"MSN"},{"url":"https://decrypt.co/328057/cloudflare-hits-kill-switch-ai-crawlers-entire-industry-cheers","title":"Cloudflare Hits the Kill Switch on AI Crawlers—And an Entire Industry Cheers"}]}},"__N_SSG":true}